suturo_planning_3rd_party/clod/doc/clod-doc.org
#+TITLE: CLOD
#+AUTHOR: Paul Sexton
#+EMAIL: eeeickythump@gmail.com
#+LINK: hs http://www.lispworks.com/reference/HyperSpec//%s
#+STARTUP: showall
#+OPTIONS: toc:4 H:10 @:t tags:nil

# link target 2: <<clod>>
# link target: <<package clod>>


* Internal Package: =clod=                                               :package:

- Uses:
    [[package common-lisp][common-lisp]], [[package iterate][iterate]], [[package
    closer-mop][closer-mop]], [[package cl-ppcre][cl-ppcre]]
- Used by:
    None.
** Description


CLOD is a tool for creating documentation for Common Lisp programs.
CLOD examines a loaded package and writes information about all the
symbols defined within that package, to a file.

The output file is in /Org/ format. Org is a simple but powerful 'wiki-like'
markup language that is understood by *Org-mode*, a powerful outliner, personal
wiki and organiser that runs as a major mode within Emacs. Org-mode can export
org-format files to numerous other formats, including HTML, LaTeX, PDF,
DocBook, and plain text.

More information:
- Emacs :: [[http://www.gnu.org/software/emacs]] (if you program CL, you don't
  need to be told what Emacs is)
- Org mode :: [[http://orgmode.org/]]

