suturo_planning_3rd_party/clod/doc/clod-doc.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>CLOD</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-03-19 17:12:24 NZDT"/>
<meta name="author" content="Paul Sexton"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">CLOD</h1>

<p><a name="clod" id="clod"></a>
<a name="package==clod" id="package==clod"></a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Internal Package: <code>clod</code></a>
<ul>
<li><a href="#sec-1.1">1.1 Description</a></li>
<li><a href="#sec-1.2">1.2 Why use CLOD?</a></li>
<li><a href="#sec-1.3">1.3 Dependencies</a></li>
<li><a href="#sec-1.4">1.4 How to use</a></li>
<li><a href="#sec-1.5">1.5 Writing the documentation</a></li>
<li><a href="#sec-1.6">1.6 Combining org mode and common lisp mode in a single Emacs buffer</a></li>
<li><a href="#sec-1.7">1.7 Example docstring</a></li>
<li><a href="#sec-1.8">1.8 External Symbols</a>
<ul>
<li><a href="#sec-1.8.1">1.8.1 External Functions</a>
<ul>
<li><a href="#sec-1.8.1.1">1.8.1.1 External Function: <code>document-package</code></a></li>
<li><a href="#sec-1.8.1.2">1.8.1.2 External Function: <code>document-packages</code></a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-1.9">1.9 Internal Symbols</a>
<ul>
<li><a href="#sec-1.9.1">1.9.1 Internal Classes</a>
<ul>
<li><a href="#sec-1.9.1.1">1.9.1.1 Internal Class: <code>animal</code></a></li>
<li><a href="#sec-1.9.1.2">1.9.1.2 Internal Class: <code>bird</code></a></li>
<li><a href="#sec-1.9.1.3">1.9.1.3 Internal Class: <code>cat</code></a></li>
<li><a href="#sec-1.9.1.4">1.9.1.4 Internal Class: <code>dog</code></a></li>
<li><a href="#sec-1.9.1.5">1.9.1.5 Internal Class: <code>hawk</code></a></li>
<li><a href="#sec-1.9.1.6">1.9.1.6 Internal Class: <code>mammal</code></a></li>
</ul>
</li>
<li><a href="#sec-1.9.2">1.9.2 Internal Types</a>
<ul>
<li><a href="#sec-1.9.2.1">1.9.2.1 Internal Type: ==entity==</a></li>
</ul>
</li>
<li><a href="#sec-1.9.3">1.9.3 Internal Global Variables</a>
<ul>
<li><a href="#sec-1.9.3.1">1.9.3.1 Internal Variable: <code>*accessibilities*</code></a></li>
<li><a href="#sec-1.9.3.2">1.9.3.2 Internal Variable: <code>*alphabet*</code></a></li>
<li><a href="#sec-1.9.3.3">1.9.3.3 Internal Variable: <code>*ambiguities*</code></a></li>
<li><a href="#sec-1.9.3.4">1.9.3.4 Internal Variable: <code>*auto-links*</code></a></li>
<li><a href="#sec-1.9.3.5">1.9.3.5 Internal Variable: <code>*brief-methods*</code></a></li>
<li><a href="#sec-1.9.3.6">1.9.3.6 Internal Variable: <code>*class-diagram*</code></a></li>
<li><a href="#sec-1.9.3.7">1.9.3.7 Internal Variable: <code>*clod-version-string*</code></a></li>
<li><a href="#sec-1.9.3.8">1.9.3.8 Internal Variable: <code>*document-author*</code></a></li>
<li><a href="#sec-1.9.3.9">1.9.3.9 Internal Variable: <code>*document-email*</code></a></li>
<li><a href="#sec-1.9.3.10">1.9.3.10 Internal Variable: <code>*document-style-sheet*</code></a></li>
<li><a href="#sec-1.9.3.11">1.9.3.11 Internal Variable: <code>*document-title*</code></a></li>
<li><a href="#sec-1.9.3.12">1.9.3.12 Internal Variable: <code>*heading-char*</code></a></li>
<li><a href="#sec-1.9.3.13">1.9.3.13 Internal Variable: <code>*heading-level*</code></a></li>
<li><a href="#sec-1.9.3.14">1.9.3.14 Internal Variable: <code>*hyperspec-root*</code></a></li>
<li><a href="#sec-1.9.3.15">1.9.3.15 Internal Variable: <code>*left-margin*</code></a></li>
<li><a href="#sec-1.9.3.16">1.9.3.16 Internal Variable: <code>*line-width*</code></a></li>
<li><a href="#sec-1.9.3.17">1.9.3.17 Internal Variable: <code>*lines-between-sections*</code></a></li>
<li><a href="#sec-1.9.3.18">1.9.3.18 Internal Variable: <code>*out*</code></a></li>
<li><a href="#sec-1.9.3.19">1.9.3.19 Internal Variable: <code>*unsafe-html-chars*</code></a></li>
</ul>
</li>
<li><a href="#sec-1.9.4">1.9.4 Internal Macros</a>
<ul>
<li><a href="#sec-1.9.4.1">1.9.4.1 Internal Macro: <code>do-own-symbols</code></a></li>
<li><a href="#sec-1.9.4.2">1.9.4.2 Internal Macro: <code>write-indented</code></a></li>
<li><a href="#sec-1.9.4.3">1.9.4.3 Internal Macro: <code>writing-bulleted-list</code></a></li>
<li><a href="#sec-1.9.4.4">1.9.4.4 Internal Macro: <code>writing-section</code></a></li>
<li><a href="#sec-1.9.4.5">1.9.4.5 Internal Macro: <code>writing-section-for-symbol</code></a></li>
</ul>
</li>
<li><a href="#sec-1.9.5">1.9.5 Internal Functions</a>
<ul>
<li><a href="#sec-1.9.5.1">1.9.5.1 Internal Function: <code>accessible-symbols</code></a></li>
<li><a href="#sec-1.9.5.2">1.9.5.2 Internal Function: <code>ampersand-symbol?</code></a></li>
<li><a href="#sec-1.9.5.3">1.9.5.3 Internal Function: <code>declared-special-p</code></a></li>
<li><a href="#sec-1.9.5.4">1.9.5.4 Internal Function: <code>docpkg</code></a></li>
<li><a href="#sec-1.9.5.5">1.9.5.5 Internal Function: <code>document</code></a></li>
<li><a href="#sec-1.9.5.6">1.9.5.6 Internal Function: <code>document-package-contents</code></a></li>
<li><a href="#sec-1.9.5.7">1.9.5.7 Internal Function: <code>entity-&gt;string</code></a></li>
<li><a href="#sec-1.9.5.8">1.9.5.8 Internal Function: <code>entity-&gt;tag</code></a></li>
<li><a href="#sec-1.9.5.9">1.9.5.9 Internal Function: <code>find-pkg</code></a></li>
<li><a href="#sec-1.9.5.10">1.9.5.10 Internal Function: <code>find-sym</code></a></li>
<li><a href="#sec-1.9.5.11">1.9.5.11 Internal Function: <code>function-lambda-list</code></a></li>
<li><a href="#sec-1.9.5.12">1.9.5.12 Internal Function: <code>function-name</code></a></li>
<li><a href="#sec-1.9.5.13">1.9.5.13 Internal Function: <code>html-safe-string</code></a></li>
<li><a href="#sec-1.9.5.14">1.9.5.14 Internal Function: <code>list-&gt;string-with-commas</code></a></li>
<li><a href="#sec-1.9.5.15">1.9.5.15 Internal Function: <code>list-all-direct-slots</code></a></li>
<li><a href="#sec-1.9.5.16">1.9.5.16 Internal Function: <code>list-all-indirect-slots</code></a></li>
<li><a href="#sec-1.9.5.17">1.9.5.17 Internal Function: <code>list-all-slot-accessors</code></a></li>
<li><a href="#sec-1.9.5.18">1.9.5.18 Internal Function: <code>make-class-link</code></a></li>
<li><a href="#sec-1.9.5.19">1.9.5.19 Internal Function: <code>make-link</code></a></li>
<li><a href="#sec-1.9.5.20">1.9.5.20 Internal Function: <code>make-package-link</code></a></li>
<li><a href="#sec-1.9.5.21">1.9.5.21 Internal Function: <code>make-specialised-lambda-list</code></a></li>
<li><a href="#sec-1.9.5.22">1.9.5.22 Internal Function: <code>make-target</code></a></li>
<li><a href="#sec-1.9.5.23">1.9.5.23 Internal Function: <code>map-list</code></a></li>
<li><a href="#sec-1.9.5.24">1.9.5.24 Internal Function: <code>org-safe-symbol</code></a></li>
<li><a href="#sec-1.9.5.25">1.9.5.25 Internal Function: <code>replace-strings-with-symbols</code></a></li>
<li><a href="#sec-1.9.5.26">1.9.5.26 Internal Function: <code>simple-type?</code></a></li>
<li><a href="#sec-1.9.5.27">1.9.5.27 Internal Function: <code>str+</code></a></li>
<li><a href="#sec-1.9.5.28">1.9.5.28 Internal Function: <code>string-starts-with?</code></a></li>
<li><a href="#sec-1.9.5.29">1.9.5.29 Internal Function: <code>symbol-accessibility</code></a></li>
<li><a href="#sec-1.9.5.30">1.9.5.30 Internal Function: <code>type-&gt;string</code></a></li>
<li><a href="#sec-1.9.5.31">1.9.5.31 Internal Function: <code>uses-for-symbol</code></a></li>
<li><a href="#sec-1.9.5.32">1.9.5.32 Internal Function: <code>word-wrap</code></a></li>
<li><a href="#sec-1.9.5.33">1.9.5.33 Internal Function: <code>wrap-and-write</code></a></li>
<li><a href="#sec-1.9.5.34">1.9.5.34 Internal Function: <code>wrap-and-write-code</code></a></li>
<li><a href="#sec-1.9.5.35">1.9.5.35 Internal Function: <code>write-bullet-point</code></a></li>
<li><a href="#sec-1.9.5.36">1.9.5.36 Internal Function: <code>write-chapter</code></a></li>
<li><a href="#sec-1.9.5.37">1.9.5.37 Internal Function: <code>write-class-hierarchy</code></a></li>
<li><a href="#sec-1.9.5.38">1.9.5.38 Internal Function: <code>write-colophon</code></a></li>
<li><a href="#sec-1.9.5.39">1.9.5.39 Internal Function: <code>write-disambiguation</code></a></li>
<li><a href="#sec-1.9.5.40">1.9.5.40 Internal Function: <code>write-docstring</code></a></li>
<li><a href="#sec-1.9.5.41">1.9.5.41 Internal Function: <code>write-docstring-section</code></a></li>
<li><a href="#sec-1.9.5.42">1.9.5.42 Internal Function: <code>write-heading</code></a></li>
<li><a href="#sec-1.9.5.43">1.9.5.43 Internal Function: <code>write-index</code></a></li>
<li><a href="#sec-1.9.5.44">1.9.5.44 Internal Function: <code>write-lambda-list-section</code></a></li>
<li><a href="#sec-1.9.5.45">1.9.5.45 Internal Function: <code>write-lines</code></a></li>
<li><a href="#sec-1.9.5.46">1.9.5.46 Internal Function: <code>write-list-as-paragraph</code></a></li>
<li><a href="#sec-1.9.5.47">1.9.5.47 Internal Function: <code>write-out</code></a></li>
<li><a href="#sec-1.9.5.48">1.9.5.48 Internal Function: <code>write-preamble</code></a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-1.10">1.10 Index</a>
<ul>
<li><a href="#sec-1.10.1">1.10.1 Nonalphabetic</a></li>
<li><a href="#sec-1.10.2">1.10.2 A</a></li>
<li><a href="#sec-1.10.3">1.10.3 B</a></li>
<li><a href="#sec-1.10.4">1.10.4 C</a></li>
<li><a href="#sec-1.10.5">1.10.5 D</a></li>
<li><a href="#sec-1.10.6">1.10.6 E</a></li>
<li><a href="#sec-1.10.7">1.10.7 F</a></li>
<li><a href="#sec-1.10.8">1.10.8 H</a></li>
<li><a href="#sec-1.10.9">1.10.9 L</a></li>
<li><a href="#sec-1.10.10">1.10.10 M</a></li>
<li><a href="#sec-1.10.11">1.10.11 O</a></li>
<li><a href="#sec-1.10.12">1.10.12 R</a></li>
<li><a href="#sec-1.10.13">1.10.13 S</a></li>
<li><a href="#sec-1.10.14">1.10.14 T</a></li>
<li><a href="#sec-1.10.15">1.10.15 U</a></li>
<li><a href="#sec-1.10.16">1.10.16 W</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Colophon</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Internal Package: <code>clod</code></h2>
<div class="outline-text-2" id="text-1">


<ul>
<li>
Uses:
<a href="#package==common-lisp">common-lisp</a>, <a href="#package==iterate">iterate</a>, <a href="#package==closer-mop">closer-mop</a>, <a href="#package==cl-ppcre">cl-ppcre</a>
</li>
<li>
Used by:
None.
</li>
</ul>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Description</h3>
<div class="outline-text-3" id="text-1.1">



<p>
CLOD is a tool for creating documentation for Common Lisp programs.
CLOD examines a loaded package and writes information about all the
symbols defined within that package, to a file.
</p>
<p>
The output file is in <i>Org</i> format. Org is a simple but powerful 'wiki-like'
markup language that is understood by <b>Org-mode</b>, a powerful outliner, personal
wiki and organiser that runs as a major mode within Emacs. Org-mode can export
org-format files to numerous other formats, including HTML, LaTeX, PDF,
DocBook, and plain text.
</p>
<p>
More information:
</p><dl>
<dt>Emacs</dt><dd>
<a href="http://www.gnu.org/software/emacs">http://www.gnu.org/software/emacs</a> (if you program CL, you don't
need to be told what Emacs is)
</dd>
<dt>Org mode</dt><dd>
<a href="http://orgmode.org/">http://orgmode.org/</a>

</dd>
</dl>
</div>

</div>
