suturo_planning_3rd_party/clod/doc/clod-doc.html

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Why use CLOD?</h3>
<div class="outline-text-3" id="text-1.2">



<ul>
<li>
You can use org markup within docstrings (easy for humans to read) to
create subsections, bulleted lists, hyperlinks within the document or
to external URLs, etc.
</li>
<li>
Easy export to multiple file formats: text, HTML, LaTeX -&gt; PDF&hellip;
</li>
<li>
You can edit the output within Emacs, which is already the IDE of most
Commn Lisp programmers.
</li>
<li>
If GraphViz is installed, automatically create a diagram illustrating the
package's class hierarchy &ndash; see <a href="http://www.graphviz.org/">http://www.graphviz.org/</a>
</li>
<li>
Org markup has many cool tricks. Some examples of useful things you can
put in docstrings:
<ul>
<li>
Include an entire file and format as plain text:
<pre class="example">
#+INCLUDE: "filename" quote
</pre>

</li>
<li>
Include an entire file with common lisp syntax highlighting
<pre class="example">
#+INCLUDE: "filename.lisp" src lisp
</pre>

</li>
<li>
Timestamps and datestamps:
<pre class="example">
{{{ modification-time(%r) }}}
</pre>

<p>05:11:36 PM
</p><pre class="example">
{{{ date(%Y-%m-%d) }}}
</pre>

<p>2010-03-19
</p></li>
<li>
Define text macros, use with <code>{{{macro(arg1,arg2)}}}</code>
<pre class="example">
#+MACRO: foo Replacement text $1 $2
</pre>

</li>
<li>
Embed any LaTeX code directly (no special markup needed)
</li>
<li>
Embed any HTML code (special markup needed)
</li>
<li>
Automatic syntax highlighting of source code examples in exported
documents, eg:

</li>
</ul>
</li>
</ul>


<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #8b4789; font-weight: bold;">defun</span> <span style="color: #1e90ff; font-weight: bold;">hello</span> <span style="color: #696969;">(</span>a <span style="color: #d2691e; font-weight: bold;">&amp;key</span> b<span style="color: #696969;">)</span>
   <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">print</span> <span style="color: #008b00;">"Hello, world!"</span><span style="color: #696969;">))</span>
</pre>


<ul>
<li>
Because CLOD works by introspection rather than parsing files,
it copes effortlessly with unusual toplevel forms. Documentation
generators that parse files usually won't be able to tell that your
toplevel macro `=(defclass-easy &hellip;)=' (or whatever) actually
expands to a class definition.
</li>
<li>
For the same reason, CLOD avoids the problems with dependencies that
can trouble other documentation generators (i.e. difficulties
generating correct documentation unless you manually move things
around in the source so that the doc generator finds things in
the `right' order).
</li>
<li>
Easily change the global appearance of the document by specifying a
cascading style sheet (<i>note: only affects HTML export from Org mode</i>)

</li>
</ul>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Dependencies</h3>
<div class="outline-text-3" id="text-1.3">



<ul>
<li>
ASDF
</li>
<li>
Closer-MOP: <a href="http://common-lisp.net/project/closer/">http://common-lisp.net/project/closer/</a>
</li>
<li>
Iterate: <a href="http://common-lisp.net/project/iterate/">http://common-lisp.net/project/iterate/</a>
</li>
<li>
CL-PPCRE: <a href="http://weitz.de/cl-ppcre/">http://weitz.de/cl-ppcre/</a>

</li>
</ul>
</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> How to use</h3>
<div class="outline-text-3" id="text-1.4">



<ol>
<li>
Install CLOD somewhere ASDF can find it.
</li>
<li>
Load CLOD with <code>(asdf:oos 'asdf:load-op :clod)</code>
</li>
<li>
Load the package or packages for which you wish to produce documentation,
eg: <code>(asdf:oos 'asdf:load-op :mypkg)</code>
</li>
<li>
Run <code>(clod:document-package :mypkg nil)</code> and you will see the documentation
as a string, returned by <a href="#document-package">document-package</a>.
</li>
<li>
Run <code>(clod:document-package :mypkg "filename.org")</code> and the same
documentation will be written to 'filename.org'.
</li>
<li>
Load filename.org into Emacs. Export to HTML with <code>M-x org-export</code>, or press
C-c C-e to be presented with a menu of export options.

</li>
</ol>
</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5"><span class="section-number-3">1.5</span> Writing the documentation</h3>
<div class="outline-text-3" id="text-1.5">



<p>
All documentation produced by CLOD is obtained by <i>introspection</i>, i.e. by the
running CL process examining itself. If a symbol has an associated docstring,
it will be used by CLOD to produce the documentation for that symbol.
</p>
<p>
Within documentation strings, you can use org mode markup. This is a simple,
human-readable markup language similar to the type of markup used for wiki
editing and forum posting. See the Org
<a href="http://orgmode.org/manual/Markup.html">manual</a> for more information. Also see
the docstrings in the CLOD source code, which use org markup.
</p>
<p>
Some special points to note:
</p><ul>
<li>
Outline headings are used to structure org documents. These headings
begin with one or more asterisks at the start of the line. Thus, if you
want a large docstring to be divided into subsections, the heading for
each subsection should be a line that starts with one or more asterisks (*),
then a space, then the title of the heading.
</li>
<li>
These headings will automatically be correctly 'indented' for their location
in the structure of the final document. The whole document is one outline,
and any given docstring will usually be appearing 2 or 3 levels deep within
that outline. However, CLOD finds all heading lines within docstrings and
increases the number of asterisks appropriately.
</li>
<li>
An extra blank line is also automatically inserted after headings within
docstrings, allowing you to save screen space in the docstring itself.
</li>
<li>
By default, many docstrings are inserted within a subsection titled
'Description'. However, if you don't want this to happen, but rather want
the docstring to define its own heading names, make sure that the very first
thing in the docstring is a heading (straight after the opening quote).
(Note for mmm-mode users (see below): if the docstring starts with '###'
to signal that it is in fact a docstring, CLOD will skip the hashes before
looking to see if the string starts with a heading.)
So ="###* Arguments &hellip;"= will work in that case.
</li>
<li>
Some symbol names used by common lisp can conflict with the markup used
by org mode. For example, <code>*global-variable*</code>: asterisks are interpreted
by org mode as signifying bold text. CLOD catches these in headings and
auto-generated documentation, but not within doc strings, where you will
need to surround the offending symbol with <code>equals signs</code>.
</li>
<li>
<b>Hyperlinks</b> are created using
<pre class="example">
[[double square brackets]]
</pre>

<p>Any text surrounded by these brackets will link to the same text (case
insensitive) surrounded by <code>&lt;&lt;double angle brackets&gt;&gt;</code>. CLOD uses this to
define hyperlinks for all symbols in the package. Every symbol MYSYMBOL has:
</p><ol>
<li>
A hyperlink <code>&lt;&lt;function MYSYMBOL&gt;&gt;</code> if MYSYMBOL is a function,
<code>&lt;&lt;variable MYSYMBOL&gt;&gt;</code> if it is a global variable, etc.
</li>
<li>
A hyperlink <code>&lt;&lt;MYSYMBOL&gt;&gt;</code> which will either link to MYSYMBOL's
documentation, or to a 'disambiguation section' if the same symbol has
multiple meanings (eg there is both a function and a variable called
MYSYMBOL).
</li>
</ol>
</li>
<li>
Org mode has the ability to use Emacs' font-lock mode to produce source code
snippets that are correctly syntax highlighted for any major mode.  To use
this normally requires surrounding the code with <code>#+BEGIN_SRC ... #+END_SRC</code>.
CLOD provides a shortcut: Any lines within docstrings that begin with three
semicolons <code>;;;</code> are assumed to be example lisp source code. The first 3
semicolons are removed and the rest of the line is syntax highlighted.

</li>
</ul>
</div>

</div>
