suturo_planning_3rd_party/clod/doc/clod-doc.html

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6"><span class="section-number-3">1.6</span> Combining org mode and common lisp mode in a single Emacs buffer</h3>
<div class="outline-text-3" id="text-1.6">



<p>
You can use org mode markup within docstrings, but you can't see the effects of
the markup until you export the documentation to org using CLOD. You also don't
get access to org's support for automatic formatting of bulleted lists as you
write, or the fantastic support for writing tables, or hyperlinks that you can
click with the mouse, or &hellip;.
</p>
<p>
What if you could use all the goodness of Org, while editing docstrings in your
lisp source code? You can. This section explains how.
</p>
<ol>
<li>
Download and install nXhtml, an emacs package that contains code allowing
multiple major modes to be active in a single buffer.
<a href="http://ourcomments.org/cgi-bin/emacsw32-dl-latest.pl">http://ourcomments.org/cgi-bin/emacsw32-dl-latest.pl</a>
</li>
<li>
Add the code in `mmm-clod.el' to your .emacs file. Make sure you change
the mmm-mode directory to the directory where you installed mmm-mode.
</li>
<li>
Restart emacs. Load a lisp source file. All documentation strings should
appear with a coloured background, and when you move the cursor inside them,
you will see 'Lisp[Org]' on the modeline. 
</li>
<li>
If not everything is highlighting correctly, or if you write a new docstring
and org does not activate within it, press control-` to 'refresh' mmm-mode.

</li>
</ol>

<p>Not everything works: expanding and collapsing headings fails, and
clicking the mouse elsewhere within the doc string often causes problems. But
overall the two modes work together surprisingly well.
</p>
<p>
MMM-mode recognises the following things as doc strings:
</p><ol>
<li>
Any string that emacs fontifies using 'font-lock-doc-face'. (in other words,
font-lock mode must be active.)
</li>
<li>
Any string inside the form '<code>(:documentation STRING)</code>'.
</li>
<li>
Finally, any string whose first three characters are '###'. Since lines 
beginning with a hash are interpreted as comments by org mode, these
characters will disappear when you export your document to HTML or other
formats.

</li>
</ol>
</div>

</div>

<div id="outline-container-1.7" class="outline-3">
<h3 id="sec-1.7"><span class="section-number-3">1.7</span> Example docstring</h3>
<div class="outline-text-3" id="text-1.7">



<p>
Here is the docstring for <a href="#document-package">document-package</a>. It illustrates the use of
headings, bulleted lists, definition lists, <code>code</code>, <b>bold</b> and <i>italic</i>
markup, hyperlinks to other definitions, and syntax highlighting of lisp source
code examples.
</p>
<pre class="example">
* Arguments
- PKG :: A package name or package object.
- FILE/STREAM :: A string (filename), stream object, or =NIL=.
- AUTO-LINKS :: Boolean.
- LINES-BETWEEN-SECTIONS :: Boolean.
- BRIEF-METHODS :: Boolean.
- STYLE-SHEET :: A string.
- TITLE :: A string.
- AUTHOR :: A string.
- EMAIL :: A string.
* Returns
A string, or nil.
* Description
Produce documentation for the package =PKG=.

The documentation's destination depends on the value of =FILE/STREAM=:
- =STRING=: documentation is written to the file named by the string.
- =STREAM=: documentation is written to the already existing stream.
- =NIL=: documentation is written to a string, which is then returned by
  this function.

Explanation of optional arguments:
- =TITLE=, =AUTHOR= and =EMAIL= specify the document title, the name of
  the author, and the email address of the author.
- If =AUTO-LINKS= is non-nil, *all* occurrences of symbol names within the
  text of docstrings will be interpreted as hyperlinks, regardless of
  whether they are marked up as hyperlinks.
- If LINES-BETWEEN-SECTIONS is nil, do not output a horizontal line before
  each new section of documentation.
- If BRIEF-METHODS is nil, document individual methods with their own
  sections, just like functions and generic functions. Most people put
  'method' documentation in the docstrings of their generic functions, but
  if you set docstrings for individual methods then set this to nil.
- =STYLE-SHEET= specifies the name of a /Cascading Style Sheet/ (.CSS) file
  which will be used as the style for the document if you export it
  to HTML from org mode.

* Example
;;; (clod:document-package :mypkg "mypkg-doc.org"
;;;      :style-sheet "swiss.css" :title "My Package"
;;;      :author "F. B. Quux" :email "quux@gmail.com")

* See also
- [[document-packages]]
</pre>


</div>

</div>

<div id="outline-container-1.8" class="outline-3">
<h3 id="sec-1.8"><span class="section-number-3">1.8</span> External Symbols</h3>
<div class="outline-text-3" id="text-1.8">






</div>

<div id="outline-container-1.8.1" class="outline-4">
<h4 id="sec-1.8.1"><span class="section-number-4">1.8.1</span> External Functions</h4>
<div class="outline-text-4" id="text-1.8.1">



<hr/>

<p>
<a name="document-package" id="document-package"></a>
<a name="function==document-package" id="function==document-package"></a>
</p>


</div>

<div id="outline-container-1.8.1.1" class="outline-5">
<h5 id="sec-1.8.1.1"><span class="section-number-5">1.8.1.1</span> External Function: <code>document-package</code></h5>
<div class="outline-text-5" id="text-1.8.1.1">




</div>

<div id="outline-container-1.8.1.1.1" class="outline-6">
<h6 id="sec-1.8.1.1.1"><span class="section-number-6">1.8.1.1.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.8.1.1.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>document-package pkg file/stream <span style="color: #d2691e; font-weight: bold;">&amp;key</span> <span style="color: #696969;">(</span>auto-links <span style="color: #698b22; font-weight: bold;">nil</span><span style="color: #696969;">)</span>
                  <span style="color: #696969;">(</span>lines-between-sections <span style="color: #698b22; font-weight: bold;">t</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>brief-methods <span style="color: #698b22; font-weight: bold;">t</span><span style="color: #696969;">)</span>
                  <span style="color: #696969;">(</span>internal-symbols? <span style="color: #698b22; font-weight: bold;">t</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>class-diagram <span style="color: #698b22; font-weight: bold;">nil</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>style-sheet <span style="color: #698b22; font-weight: bold;">nil</span><span style="color: #696969;">)</span>
                  <span style="color: #696969;">(</span>title <span style="color: #698b22; font-weight: bold;">nil</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>author <span style="color: #00c5cd;">*document-author*</span><span style="color: #696969;">)</span>
                  <span style="color: #696969;">(</span>email <span style="color: #00c5cd;">*document-email*</span><span style="color: #696969;">))</span>
</pre>



</div>

</div>
