suturo_planning_3rd_party/clod/doc/clod-doc.org
***** Description

Produce documentation for the package =PKG=.

The documentation's destination depends on the value of =FILE/STREAM=:
- =STRING=: documentation is written to the file named by the string.
- =STREAM=: documentation is written to the already existing stream.
- =NIL=: documentation is written to a string, which is then returned by
  this function.

Explanation of optional arguments:
- =TITLE=, =AUTHOR= and =EMAIL= specify the document title, the name of
  the author, and the email address of the author.
- =STYLE-SHEET= specifies the name of a Cascading Style Sheet (.CSS) file
  which will be used as the style for the document if you export it
  to HTML from org mode.
- If =AUTO-LINKS= is non-nil, *all* occurrences of symbol names within the
  text of docstrings will be interpreted as hyperlinks, regardless of
  whether they are marked up as hyperlinks.
- If =LINES-BETWEEN-SECTIONS= is nil, do not output a horizontal line before
  each new section of documentation.
- If =BRIEF-METHODS= is nil, document individual methods with their own
  sections, just like functions and generic functions. Most people put
  'method' documentation in the docstrings of their generic functions, but
  if you set docstrings for individual methods then set this to nil.
- If =INTERNAL-SYMBOLS?= is non-nil, document both internal and external
  (exported) symbols. If nil, only document external symbols.
- If =CLASS-DIAGRAM= is non-nil, create a section after the toplevel package
  description, containing a description of the package hierarchy
  in the form of a GraphViz 'dot' diagram (see http://www.graphviz.org/).

***** Example

#+BEGIN_SRC lisp
 (clod:document-package :mypkg "mypkg-doc.org"
      :style-sheet "swiss.css" :title "My Package"
      :author "F. B. Quux" :email "quux@gmail.com")
#+END_SRC

***** See also

- [[document-packages]]


-----

# link target 2: <<document-packages>>
# link target: <<function document-packages>>


**** External Function: =document-packages=                                :function:


***** Syntax

#+BEGIN_SRC lisp
(document-packages packages file/stream &key (auto-links nil)
                   (lines-between-sections t) (brief-methods t)
                   (internal-symbols? t) (class-diagram nil) (style-sheet nil)
                   (title *document-title*) (author *document-author*)
                   (email *document-email*))
#+END_SRC

***** Arguments

- PACKAGES :: A list of package objects, or symbols naming packages.
- FILE/STREAM :: A string (filename), stream object, or =NIL=.
Other arguments are the same as for [[document-package]].
***** Returns

A string, or nil.
***** Description

Produces documentation for all the packages in =PACKAGES=, within a
single file.

See [[document-package]] for more details.





** Internal Symbols




*** Internal Classes

-----

# link target 2: <<animal>>
# link target: <<class animal>>


**** Internal Class: =animal=                                                 :class:


***** Inheritance

- Parent classes:
    [[class standard-object][standard-object]]
- Precedence list:
    [[class animal][animal]], [[class standard-object][standard-object]], [[class
    slot-object][slot-object]], [[class t][t]]
- Direct subclasses:
    [[class mammal][mammal]], [[class bird][bird]]


***** Description

dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.


***** Direct Slots




-----

# link target 2: <<bird>>
# link target: <<class bird>>


**** Internal Class: =bird=                                                   :class:


***** Inheritance

- Parent classes:
    [[class animal][animal]]
- Precedence list:
    [[class bird][bird]], [[class animal][animal]], [[class standard
    object][standard-object]], [[class slot-object][slot-object]], [[class t][t]]
- Direct subclasses:
    [[class hawk][hawk]]


***** Description

dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.


***** Direct Slots




-----

# link target 2: <<cat>>
# link target: <<class cat>>


**** Internal Class: =cat=                                                    :class:


