suturo_planning_3rd_party/clod/doc/clod-doc.html

<div id="outline-container-1.8.1.1.2" class="outline-6">
<h6 id="sec-1.8.1.1.2"><span class="section-number-6">1.8.1.1.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.8.1.1.2">


<dl>
<dt>PKG</dt><dd>
A package name or package object.
</dd>
<dt>FILE/STREAM</dt><dd>
A string (filename), stream object, or <code>NIL</code>.
</dd>
<dt>AUTO-LINKS</dt><dd>
Boolean.
</dd>
<dt>LINES-BETWEEN-SECTIONS</dt><dd>
Boolean.
</dd>
<dt>BRIEF-METHODS</dt><dd>
Boolean.
</dd>
<dt>INTERNAL-SYMBOLS</dt><dd>
Boolean.
</dd>
<dt>CLASS-DIAGRAM</dt><dd>
Boolean.
</dd>
<dt>STYLE-SHEET</dt><dd>
A string.
</dd>
<dt>TITLE</dt><dd>
A string.
</dd>
<dt>AUTHOR</dt><dd>
A string.
</dd>
<dt>EMAIL</dt><dd>
A string.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.8.1.1.3" class="outline-6">
<h6 id="sec-1.8.1.1.3"><span class="section-number-6">1.8.1.1.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.8.1.1.3">


<p>
A string, or nil.
</p></div>

</div>

<div id="outline-container-1.8.1.1.4" class="outline-6">
<h6 id="sec-1.8.1.1.4"><span class="section-number-6">1.8.1.1.4</span> Description</h6>
<div class="outline-text-6" id="text-1.8.1.1.4">


<p>
Produce documentation for the package <code>PKG</code>.
</p>
<p>
The documentation's destination depends on the value of <code>FILE/STREAM</code>:
</p><ul>
<li>
<code>STRING</code>: documentation is written to the file named by the string.
</li>
<li>
<code>STREAM</code>: documentation is written to the already existing stream.
</li>
<li>
<code>NIL</code>: documentation is written to a string, which is then returned by
this function.

</li>
</ul>

<p>Explanation of optional arguments:
</p><ul>
<li>
<code>TITLE</code>, <code>AUTHOR</code> and <code>EMAIL</code> specify the document title, the name of
the author, and the email address of the author.
</li>
<li>
<code>STYLE-SHEET</code> specifies the name of a Cascading Style Sheet (.CSS) file
which will be used as the style for the document if you export it
to HTML from org mode.
</li>
<li>
If <code>AUTO-LINKS</code> is non-nil, <b>all</b> occurrences of symbol names within the
text of docstrings will be interpreted as hyperlinks, regardless of
whether they are marked up as hyperlinks.
</li>
<li>
If <code>LINES-BETWEEN-SECTIONS</code> is nil, do not output a horizontal line before
each new section of documentation.
</li>
<li>
If <code>BRIEF-METHODS</code> is nil, document individual methods with their own
sections, just like functions and generic functions. Most people put
'method' documentation in the docstrings of their generic functions, but
if you set docstrings for individual methods then set this to nil.
</li>
<li>
If <code>INTERNAL-SYMBOLS?</code> is non-nil, document both internal and external
(exported) symbols. If nil, only document external symbols.
</li>
<li>
If <code>CLASS-DIAGRAM</code> is non-nil, create a section after the toplevel package
description, containing a description of the package hierarchy
in the form of a GraphViz 'dot' diagram (see <a href="http://www.graphviz.org/">http://www.graphviz.org/</a>).

</li>
</ul>
</div>

</div>

<div id="outline-container-1.8.1.1.5" class="outline-6">
<h6 id="sec-1.8.1.1.5"><span class="section-number-6">1.8.1.1.5</span> Example</h6>
<div class="outline-text-6" id="text-1.8.1.1.5">





<pre class="src src-lisp"><span style="color: #696969;">(</span>clod:document-package <span style="color: #4169e1;">:mypkg</span> <span style="color: #008b00;">"mypkg-doc.org"</span>
     <span style="color: #4169e1;">:style-sheet</span> <span style="color: #008b00;">"swiss.css"</span> <span style="color: #4169e1;">:title</span> <span style="color: #008b00;">"My Package"</span>
     <span style="color: #4169e1;">:author</span> <span style="color: #008b00;">"F. B. Quux"</span> <span style="color: #4169e1;">:email</span> <span style="color: #008b00;">"quux@gmail.com"</span><span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.8.1.1.6" class="outline-6">
<h6 id="sec-1.8.1.1.6"><span class="section-number-6">1.8.1.1.6</span> See also</h6>
<div class="outline-text-6" id="text-1.8.1.1.6">


<ul>
<li>
<a href="#document-packages">document-packages</a>


</li>
</ul>


<hr/>

<p>
<a name="document-packages" id="document-packages"></a>
<a name="function==document-packages" id="function==document-packages"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.8.1.2" class="outline-5">
<h5 id="sec-1.8.1.2"><span class="section-number-5">1.8.1.2</span> External Function: <code>document-packages</code></h5>
<div class="outline-text-5" id="text-1.8.1.2">




</div>

<div id="outline-container-1.8.1.2.1" class="outline-6">
<h6 id="sec-1.8.1.2.1"><span class="section-number-6">1.8.1.2.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.8.1.2.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>document-packages packages file/stream <span style="color: #d2691e; font-weight: bold;">&amp;key</span> <span style="color: #696969;">(</span>auto-links <span style="color: #698b22; font-weight: bold;">nil</span><span style="color: #696969;">)</span>
                   <span style="color: #696969;">(</span>lines-between-sections <span style="color: #698b22; font-weight: bold;">t</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>brief-methods <span style="color: #698b22; font-weight: bold;">t</span><span style="color: #696969;">)</span>
                   <span style="color: #696969;">(</span>internal-symbols? <span style="color: #698b22; font-weight: bold;">t</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>class-diagram <span style="color: #698b22; font-weight: bold;">nil</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>style-sheet <span style="color: #698b22; font-weight: bold;">nil</span><span style="color: #696969;">)</span>
                   <span style="color: #696969;">(</span>title <span style="color: #00c5cd;">*document-title*</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>author <span style="color: #00c5cd;">*document-author*</span><span style="color: #696969;">)</span>
                   <span style="color: #696969;">(</span>email <span style="color: #00c5cd;">*document-email*</span><span style="color: #696969;">))</span>
</pre>



</div>

</div>

<div id="outline-container-1.8.1.2.2" class="outline-6">
<h6 id="sec-1.8.1.2.2"><span class="section-number-6">1.8.1.2.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.8.1.2.2">


<dl>
<dt>PACKAGES</dt><dd>
A list of package objects, or symbols naming packages.
</dd>
<dt>FILE/STREAM</dt><dd>
A string (filename), stream object, or <code>NIL</code>.
</dd>
</dl>

<p>Other arguments are the same as for <a href="#document-package">document-package</a>.
</p></div>

</div>

<div id="outline-container-1.8.1.2.3" class="outline-6">
<h6 id="sec-1.8.1.2.3"><span class="section-number-6">1.8.1.2.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.8.1.2.3">


<p>
A string, or nil.
</p></div>

</div>

<div id="outline-container-1.8.1.2.4" class="outline-6">
<h6 id="sec-1.8.1.2.4"><span class="section-number-6">1.8.1.2.4</span> Description</h6>
<div class="outline-text-6" id="text-1.8.1.2.4">


<p>
Produces documentation for all the packages in <code>PACKAGES</code>, within a
single file.
</p>
<p>
See <a href="#document-package">document-package</a> for more details.
</p>




</div>
</div>
</div>
</div>

</div>

<div id="outline-container-1.9" class="outline-3">
<h3 id="sec-1.9"><span class="section-number-3">1.9</span> Internal Symbols</h3>
<div class="outline-text-3" id="text-1.9">






</div>

<div id="outline-container-1.9.1" class="outline-4">
<h4 id="sec-1.9.1"><span class="section-number-4">1.9.1</span> Internal Classes</h4>
<div class="outline-text-4" id="text-1.9.1">



<hr/>

<p>
<a name="animal" id="animal"></a>
<a name="class==animal" id="class==animal"></a>
</p>


</div>

<div id="outline-container-1.9.1.1" class="outline-5">
<h5 id="sec-1.9.1.1"><span class="section-number-5">1.9.1.1</span> Internal Class: <code>animal</code></h5>
<div class="outline-text-5" id="text-1.9.1.1">




</div>

<div id="outline-container-1.9.1.1.1" class="outline-6">
<h6 id="sec-1.9.1.1.1"><span class="section-number-6">1.9.1.1.1</span> Inheritance</h6>
<div class="outline-text-6" id="text-1.9.1.1.1">


<ul>
<li>
Parent classes:
<a href="#class==standard-object">standard-object</a>
</li>
<li>
Precedence list:
<a href="#class==animal">animal</a>, <a href="#class==standard-object">standard-object</a>, <a href="#class==slot-object">slot-object</a>, <a href="#sec-1.9.5.26.4">t</a>
</li>
<li>
Direct subclasses:
<a href="#class==mammal">mammal</a>, <a href="#class==bird">bird</a>


</li>
</ul>
</div>

</div>

<div id="outline-container-1.9.1.1.2" class="outline-6">
<h6 id="sec-1.9.1.1.2"><span class="section-number-6">1.9.1.1.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.1.1.2">


<p>
dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.
</p>

</div>

</div>

<div id="outline-container-1.9.1.1.3" class="outline-6">
<h6 id="sec-1.9.1.1.3"><span class="section-number-6">1.9.1.1.3</span> Direct Slots</h6>
<div class="outline-text-6" id="text-1.9.1.1.3">






<hr/>

<p>
<a name="bird" id="bird"></a>
<a name="class==bird" id="class==bird"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.1.2" class="outline-5">
<h5 id="sec-1.9.1.2"><span class="section-number-5">1.9.1.2</span> Internal Class: <code>bird</code></h5>
<div class="outline-text-5" id="text-1.9.1.2">




</div>

<div id="outline-container-1.9.1.2.1" class="outline-6">
<h6 id="sec-1.9.1.2.1"><span class="section-number-6">1.9.1.2.1</span> Inheritance</h6>
<div class="outline-text-6" id="text-1.9.1.2.1">


<ul>
<li>
Parent classes:
<a href="#class==animal">animal</a>
</li>
<li>
Precedence list:
<a href="#class==bird">bird</a>, <a href="#class==animal">animal</a>, <a href="#class==standard==object">standard-object</a>, <a href="#class==slot-object">slot-object</a>, <a href="#sec-1.9.5.26.4">t</a>
</li>
<li>
Direct subclasses:
<a href="#class==hawk">hawk</a>


</li>
</ul>
</div>

</div>

<div id="outline-container-1.9.1.2.2" class="outline-6">
<h6 id="sec-1.9.1.2.2"><span class="section-number-6">1.9.1.2.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.1.2.2">


<p>
dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.
</p>

</div>

</div>

<div id="outline-container-1.9.1.2.3" class="outline-6">
<h6 id="sec-1.9.1.2.3"><span class="section-number-6">1.9.1.2.3</span> Direct Slots</h6>
<div class="outline-text-6" id="text-1.9.1.2.3">






<hr/>

<p>
<a name="cat" id="cat"></a>
<a name="class==cat" id="class==cat"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.1.3" class="outline-5">
<h5 id="sec-1.9.1.3"><span class="section-number-5">1.9.1.3</span> Internal Class: <code>cat</code></h5>
<div class="outline-text-5" id="text-1.9.1.3">




</div>
