suturo_planning_3rd_party/clod/doc/clod-doc.org
***** Inheritance

- Parent classes:
    [[class mammal][mammal]]
- Precedence list:
    [[class cat][cat]], [[class mammal][mammal]], [[class animal][animal]], [[class
    standard-object][standard-object]], [[class slot-object][slot-object]], [[class
    t][t]]
- Direct subclasses:
    None.


***** Description

dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.


***** Direct Slots




-----

# link target 2: <<dog>>
# link target: <<class dog>>


**** Internal Class: =dog=                                                    :class:


***** Inheritance

- Parent classes:
    [[class mammal][mammal]]
- Precedence list:
    [[class dog][dog]], [[class mammal][mammal]], [[class animal][animal]], [[class
    standard-object][standard-object]], [[class slot-object][slot-object]], [[class
    t][t]]
- Direct subclasses:
    None.


***** Description

dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.


***** Direct Slots




-----

# link target 2: <<hawk>>
# link target: <<class hawk>>


**** Internal Class: =hawk=                                                   :class:


***** Inheritance

- Parent classes:
    [[class bird][bird]]
- Precedence list:
    [[class hawk][hawk]], [[class bird][bird]], [[class animal][animal]], [[class
    standard-object][standard-object]], [[class slot-object][slot-object]], [[class
    t][t]]
- Direct subclasses:
    None.


***** Description

dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.


***** Direct Slots




-----

# link target 2: <<mammal>>
# link target: <<class mammal>>


**** Internal Class: =mammal=                                                 :class:


***** Inheritance

- Parent classes:
    [[class animal][animal]]
- Precedence list:
    [[class mammal][mammal]], [[class animal][animal]], [[class standard
    object][standard-object]], [[class slot-object][slot-object]], [[class t][t]]
- Direct subclasses:
    [[class dog][dog]], [[class cat][cat]]


***** Description

dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.


***** Direct Slots






*** Internal Types

-----

# link target 2: <<..3d..entity..3d..>>
# link target: <<type ..3d..entity..3d..>>


**** Internal Type: ==entity==                                                 :type:

The type 'entity' can have any of several different symbols as its value.
Each value is a different kind of 'meaning' which a symbol can have within
a package. For example, =:function= is a function, =:class= is a class,
and so on.




*** Internal Global Variables

-----

# link target 2: <<*accessibilities*>>
# link target: <<variable *accessibilities*>>


**** Internal Variable: =*accessibilities*=                                :variable:


***** Value

: (:EXTERNAL :INTERNAL)

Type: =cons=


***** Description

List of one or both of the keywords =:EXTERNAL= and =:INTERNAL=.
Only symbols whose accessibility matches one of the keywords in the list
will be documented.



-----

# link target 2: <<*alphabet*>>
# link target: <<variable *alphabet*>>


**** Internal Variable: =*alphabet*=                                       :variable:


***** Value

: (#\A #\B #\C #\D #\E #\F #\G #\H #\I #\J #\K #\L #\M #\N #\O #\P #\Q #\R #\S 
: #\T #\U #\V #\W #\X #\Y #\Z)

Type: =cons=


***** Description

List of uppercase letters (characters) from A to Z.



-----

# link target 2: <<*ambiguities*>>
# link target: <<variable *ambiguities*>>


**** Internal Variable: =*ambiguities*=                                    :variable:


***** Value

: #<HASH-TABLE :TEST EQL :COUNT 0 {103534C1}>

Type: =hash-table=


***** Description

Hash table created during package documentation. Stores all
symbols which have multiple 'meanings' within the package.



-----

# link target 2: <<*auto-links*>>
# link target: <<variable *auto-links*>>


**** Internal Variable: =*auto-links*=                                     :variable:


***** Value

: NIL

Type: =null=


***** Description

If true, all occurrences of package symbols anywhere in the documentation
will be turned into hyperlinks, even if they are not marked up as such.



-----

# link target 2: <<*brief-methods*>>
# link target: <<variable *brief-methods*>>


**** Internal Variable: =*brief-methods*=                                  :variable:


***** Value

: T

Type: =boolean=


