suturo_planning_3rd_party/clod/doc/clod-doc.html

<div id="outline-container-1.9.1.3.1" class="outline-6">
<h6 id="sec-1.9.1.3.1"><span class="section-number-6">1.9.1.3.1</span> Inheritance</h6>
<div class="outline-text-6" id="text-1.9.1.3.1">


<ul>
<li>
Parent classes:
<a href="#class==mammal">mammal</a>
</li>
<li>
Precedence list:
<a href="#class==cat">cat</a>, <a href="#class==mammal">mammal</a>, <a href="#class==animal">animal</a>, <a href="#class==standard-object">standard-object</a>, <a href="#class==slot-object">slot-object</a>, <a href="#sec-1.9.5.26.4">t</a>
</li>
<li>
Direct subclasses:
None.


</li>
</ul>
</div>

</div>

<div id="outline-container-1.9.1.3.2" class="outline-6">
<h6 id="sec-1.9.1.3.2"><span class="section-number-6">1.9.1.3.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.1.3.2">


<p>
dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.
</p>

</div>

</div>

<div id="outline-container-1.9.1.3.3" class="outline-6">
<h6 id="sec-1.9.1.3.3"><span class="section-number-6">1.9.1.3.3</span> Direct Slots</h6>
<div class="outline-text-6" id="text-1.9.1.3.3">






<hr/>

<p>
<a name="dog" id="dog"></a>
<a name="class==dog" id="class==dog"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.1.4" class="outline-5">
<h5 id="sec-1.9.1.4"><span class="section-number-5">1.9.1.4</span> Internal Class: <code>dog</code></h5>
<div class="outline-text-5" id="text-1.9.1.4">




</div>

<div id="outline-container-1.9.1.4.1" class="outline-6">
<h6 id="sec-1.9.1.4.1"><span class="section-number-6">1.9.1.4.1</span> Inheritance</h6>
<div class="outline-text-6" id="text-1.9.1.4.1">


<ul>
<li>
Parent classes:
<a href="#class==mammal">mammal</a>
</li>
<li>
Precedence list:
<a href="#class==dog">dog</a>, <a href="#class==mammal">mammal</a>, <a href="#class==animal">animal</a>, <a href="#class==standard-object">standard-object</a>, <a href="#class==slot-object">slot-object</a>, <a href="#sec-1.9.5.26.4">t</a>
</li>
<li>
Direct subclasses:
None.


</li>
</ul>
</div>

</div>

<div id="outline-container-1.9.1.4.2" class="outline-6">
<h6 id="sec-1.9.1.4.2"><span class="section-number-6">1.9.1.4.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.1.4.2">


<p>
dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.
</p>

</div>

</div>

<div id="outline-container-1.9.1.4.3" class="outline-6">
<h6 id="sec-1.9.1.4.3"><span class="section-number-6">1.9.1.4.3</span> Direct Slots</h6>
<div class="outline-text-6" id="text-1.9.1.4.3">






<hr/>

<p>
<a name="hawk" id="hawk"></a>
<a name="class==hawk" id="class==hawk"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.1.5" class="outline-5">
<h5 id="sec-1.9.1.5"><span class="section-number-5">1.9.1.5</span> Internal Class: <code>hawk</code></h5>
<div class="outline-text-5" id="text-1.9.1.5">




</div>

<div id="outline-container-1.9.1.5.1" class="outline-6">
<h6 id="sec-1.9.1.5.1"><span class="section-number-6">1.9.1.5.1</span> Inheritance</h6>
<div class="outline-text-6" id="text-1.9.1.5.1">


<ul>
<li>
Parent classes:
<a href="#class==bird">bird</a>
</li>
<li>
Precedence list:
<a href="#class==hawk">hawk</a>, <a href="#class==bird">bird</a>, <a href="#class==animal">animal</a>, <a href="#class==standard-object">standard-object</a>, <a href="#class==slot-object">slot-object</a>, <a href="#sec-1.9.5.26.4">t</a>
</li>
<li>
Direct subclasses:
None.


</li>
</ul>
</div>

</div>

<div id="outline-container-1.9.1.5.2" class="outline-6">
<h6 id="sec-1.9.1.5.2"><span class="section-number-6">1.9.1.5.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.1.5.2">


<p>
dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.
</p>

</div>

</div>

<div id="outline-container-1.9.1.5.3" class="outline-6">
<h6 id="sec-1.9.1.5.3"><span class="section-number-6">1.9.1.5.3</span> Direct Slots</h6>
<div class="outline-text-6" id="text-1.9.1.5.3">






<hr/>

<p>
<a name="mammal" id="mammal"></a>
<a name="class==mammal" id="class==mammal"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.1.6" class="outline-5">
<h5 id="sec-1.9.1.6"><span class="section-number-5">1.9.1.6</span> Internal Class: <code>mammal</code></h5>
<div class="outline-text-5" id="text-1.9.1.6">




</div>

<div id="outline-container-1.9.1.6.1" class="outline-6">
<h6 id="sec-1.9.1.6.1"><span class="section-number-6">1.9.1.6.1</span> Inheritance</h6>
<div class="outline-text-6" id="text-1.9.1.6.1">


<ul>
<li>
Parent classes:
<a href="#class==animal">animal</a>
</li>
<li>
Precedence list:
<a href="#class==mammal">mammal</a>, <a href="#class==animal">animal</a>, <a href="#class==standard==object">standard-object</a>, <a href="#class==slot-object">slot-object</a>, <a href="#sec-1.9.5.26.4">t</a>
</li>
<li>
Direct subclasses:
<a href="#class==dog">dog</a>, <a href="#class==cat">cat</a>


</li>
</ul>
</div>

</div>

<div id="outline-container-1.9.1.6.2" class="outline-6">
<h6 id="sec-1.9.1.6.2"><span class="section-number-6">1.9.1.6.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.1.6.2">


<p>
dummy class, created to illustrate CLOD's ability
to produce class diagrams using GraphViz.
</p>

</div>

</div>

<div id="outline-container-1.9.1.6.3" class="outline-6">
<h6 id="sec-1.9.1.6.3"><span class="section-number-6">1.9.1.6.3</span> Direct Slots</h6>
<div class="outline-text-6" id="text-1.9.1.6.3">







</div>
</div>
</div>

</div>

<div id="outline-container-1.9.2" class="outline-4">
<h4 id="sec-1.9.2"><span class="section-number-4">1.9.2</span> Internal Types</h4>
<div class="outline-text-4" id="text-1.9.2">



<hr/>

<p>
<a name="..3d..entity..3d.." id="..3d..entity..3d.."></a>
<a name="type==..3d..entity..3d.." id="type==..3d..entity..3d.."></a>
</p>


</div>

<div id="outline-container-1.9.2.1" class="outline-5">
<h5 id="sec-1.9.2.1"><span class="section-number-5">1.9.2.1</span> Internal Type: ==entity==</h5>
<div class="outline-text-5" id="text-1.9.2.1">


<p>
The type 'entity' can have any of several different symbols as its value.
Each value is a different kind of 'meaning' which a symbol can have within
a package. For example, <code>:function</code> is a function, <code>:class</code> is a class,
and so on.
</p>



</div>
</div>

</div>

<div id="outline-container-1.9.3" class="outline-4">
<h4 id="sec-1.9.3"><span class="section-number-4">1.9.3</span> Internal Global Variables</h4>
<div class="outline-text-4" id="text-1.9.3">



<hr/>

<p>
<a name="<b>accessibilities</b>" id="<b>accessibilities</b>"></a>
<a name="variable==*accessibilities*" id="variable==*accessibilities*"></a>
</p>


</div>

<div id="outline-container-1.9.3.1" class="outline-5">
<h5 id="sec-1.9.3.1"><span class="section-number-5">1.9.3.1</span> Internal Variable: <code>*accessibilities*</code></h5>
<div class="outline-text-5" id="text-1.9.3.1">




</div>

<div id="outline-container-1.9.3.1.1" class="outline-6">
<h6 id="sec-1.9.3.1.1"><span class="section-number-6">1.9.3.1.1</span> Value</h6>
<div class="outline-text-6" id="text-1.9.3.1.1">


<pre class="example">
(:EXTERNAL :INTERNAL)
</pre>


<p>
Type: <code>cons</code>
</p>

</div>

</div>

<div id="outline-container-1.9.3.1.2" class="outline-6">
<h6 id="sec-1.9.3.1.2"><span class="section-number-6">1.9.3.1.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.3.1.2">


<p>
List of one or both of the keywords <code>:EXTERNAL</code> and <code>:INTERNAL</code>.
Only symbols whose accessibility matches one of the keywords in the list
will be documented.
</p>



<hr/>

<p>
<a name="<b>alphabet</b>" id="<b>alphabet</b>"></a>
<a name="variable==*alphabet*" id="variable==*alphabet*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.3.2" class="outline-5">
<h5 id="sec-1.9.3.2"><span class="section-number-5">1.9.3.2</span> Internal Variable: <code>*alphabet*</code></h5>
<div class="outline-text-5" id="text-1.9.3.2">




</div>

<div id="outline-container-1.9.3.2.1" class="outline-6">
<h6 id="sec-1.9.3.2.1"><span class="section-number-6">1.9.3.2.1</span> Value</h6>
<div class="outline-text-6" id="text-1.9.3.2.1">


<pre class="example">
(#\A #\B #\C #\D #\E #\F #\G #\H #\I #\J #\K #\L #\M #\N #\O #\P #\Q #\R #\S 
#\T #\U #\V #\W #\X #\Y #\Z)
</pre>


<p>
Type: <code>cons</code>
</p>

</div>

</div>

<div id="outline-container-1.9.3.2.2" class="outline-6">
<h6 id="sec-1.9.3.2.2"><span class="section-number-6">1.9.3.2.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.3.2.2">


<p>
List of uppercase letters (characters) from A to Z.
</p>



<hr/>

<p>
<a name="<b>ambiguities</b>" id="<b>ambiguities</b>"></a>
<a name="variable==*ambiguities*" id="variable==*ambiguities*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.3.3" class="outline-5">
<h5 id="sec-1.9.3.3"><span class="section-number-5">1.9.3.3</span> Internal Variable: <code>*ambiguities*</code></h5>
<div class="outline-text-5" id="text-1.9.3.3">




</div>

<div id="outline-container-1.9.3.3.1" class="outline-6">
<h6 id="sec-1.9.3.3.1"><span class="section-number-6">1.9.3.3.1</span> Value</h6>
<div class="outline-text-6" id="text-1.9.3.3.1">


<pre class="example">
#&lt;HASH-TABLE :TEST EQL :COUNT 0 {103534C1}&gt;
</pre>


<p>
Type: <code>hash-table</code>
</p>

</div>

</div>

<div id="outline-container-1.9.3.3.2" class="outline-6">
<h6 id="sec-1.9.3.3.2"><span class="section-number-6">1.9.3.3.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.3.3.2">


<p>
Hash table created during package documentation. Stores all
symbols which have multiple 'meanings' within the package.
</p>



<hr/>

<p>
<a name="<b>auto-links</b>" id="<b>auto-links</b>"></a>
<a name="variable==*auto-links*" id="variable==*auto-links*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.3.4" class="outline-5">
<h5 id="sec-1.9.3.4"><span class="section-number-5">1.9.3.4</span> Internal Variable: <code>*auto-links*</code></h5>
<div class="outline-text-5" id="text-1.9.3.4">




</div>

<div id="outline-container-1.9.3.4.1" class="outline-6">
<h6 id="sec-1.9.3.4.1"><span class="section-number-6">1.9.3.4.1</span> Value</h6>
<div class="outline-text-6" id="text-1.9.3.4.1">


<pre class="example">
NIL
</pre>


<p>
Type: <code>null</code>
</p>

</div>

</div>

<div id="outline-container-1.9.3.4.2" class="outline-6">
<h6 id="sec-1.9.3.4.2"><span class="section-number-6">1.9.3.4.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.3.4.2">


<p>
If true, all occurrences of package symbols anywhere in the documentation
will be turned into hyperlinks, even if they are not marked up as such.
</p>



<hr/>

<p>
<a name="<b>brief-methods</b>" id="<b>brief-methods</b>"></a>
<a name="variable==*brief-methods*" id="variable==*brief-methods*"></a>
</p>

</div>
</div>

</div>
