suturo_planning_3rd_party/clod/doc/clod-doc.org
***** Description

Width to which paragraphs are wrapped, in characters.



-----

# link target 2: <<*lines-between-sections*>>
# link target: <<variable *lines-between-sections*>>


**** Internal Variable: =*lines-between-sections*=                         :variable:


***** Value

: T

Type: =boolean=


***** Description

If true, sections of the document will be separated by horizontal lines.



-----

# link target 2: <<*out*>>
# link target: <<variable *out*>>


**** Internal Variable: =*out*=                                            :variable:


***** Value

: #<SB-SYS:FD-STREAM for "file /home/paul/Dropbox/lisp/clod/doc/clod-doc.org"
: {FCB6D11}>

Type: =fd-stream=


***** Description

Global variable that is bound to the output stream used by CLOD
while writing documentation.



-----

# link target 2: <<*unsafe-html-chars*>>
# link target: <<variable *unsafe-html-chars*>>


**** Internal Variable: =*unsafe-html-chars*=                              :variable:


***** Value

: (#\< #\> #\= #\% #\? #\+ #\$ #\/ #\& #\@ #\, #\{ #\} #\^ #\~)

Type: =cons=


***** Description

List of characters which are unsafe within HTML links and anchors, and
which need to be converted to a safe representation.

See also: [[html-safe-string]].





*** Internal Macros

-----

# link target 2: <<do-own-symbols>>
# link target: <<macro do-own-symbols>>


**** Internal Macro: =do-own-symbols=                                         :macro:


***** Syntax

#+BEGIN_SRC lisp
(do-own-symbols (var pkg)
  &body
  body)
#+END_SRC

***** Arguments

- VAR :: symbol naming a variable that will be bound to each symbol in turn.
- PKG :: a package.
***** Description

Iterate through all the non-imported symbols in the package =PKG=.
=BODY= is executed once for each such symbol, with =VAR= bound to each
symbol in turn.


-----

# link target 2: <<write-indented>>
# link target: <<macro write-indented>>


**** Internal Macro: =write-indented=                                         :macro:


***** Syntax

#+BEGIN_SRC lisp
(write-indented (indent)
  &body
  body)
#+END_SRC

***** Arguments

- INDENT :: An integer.
***** Return Value

Ignored.
***** Description

All text that is written within the body of the form will be indented
a further =INDENT= spaces from the left margin.


-----

# link target 2: <<writing-bulleted-list>>
# link target: <<macro writing-bulleted-list>>


**** Internal Macro: =writing-bulleted-list=                                  :macro:


***** Syntax

#+BEGIN_SRC lisp
(writing-bulleted-list
  &body
  body)
#+END_SRC


***** Description

All output within the body of a form is assumed to be within a
bulleted list.



-----

# link target 2: <<writing-section>>
# link target: <<macro writing-section>>


**** Internal Macro: =writing-section=                                        :macro:


***** Syntax

#+BEGIN_SRC lisp
(writing-section (title)
  &body
  body)
#+END_SRC


***** Description

Wraps all output within the body of the form in its own section.



-----

# link target 2: <<writing-section-for-symbol>>
# link target: <<macro writing-section-for-symbol>>


**** Internal Macro: =writing-section-for-symbol=                             :macro:


***** Syntax

#+BEGIN_SRC lisp
(writing-section-for-symbol (entity sym)
  &body
  body)
#+END_SRC


***** Description

Wraps all output within the body of the form in its own section. The
title of the section describes the entity of type =ENTITY= that is
bound to the symbol =SYM=.





*** Internal Functions

-----

# link target 2: <<accessible-symbols>>
# link target: <<function accessible-symbols>>


**** Internal Function: =accessible-symbols=                               :function:


***** Syntax

#+BEGIN_SRC lisp
(accessible-symbols syms access pkg)
#+END_SRC

