suturo_planning_3rd_party/clod/doc/clod-doc.html

<div id="outline-container-1.9.3.16" class="outline-5">
<h5 id="sec-1.9.3.16"><span class="section-number-5">1.9.3.16</span> Internal Variable: <code>*line-width*</code></h5>
<div class="outline-text-5" id="text-1.9.3.16">




</div>

<div id="outline-container-1.9.3.16.1" class="outline-6">
<h6 id="sec-1.9.3.16.1"><span class="section-number-6">1.9.3.16.1</span> Value</h6>
<div class="outline-text-6" id="text-1.9.3.16.1">


<pre class="example">
80
</pre>


<p>
Type: <code>integer</code>
</p>

</div>

</div>

<div id="outline-container-1.9.3.16.2" class="outline-6">
<h6 id="sec-1.9.3.16.2"><span class="section-number-6">1.9.3.16.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.3.16.2">


<p>
Width to which paragraphs are wrapped, in characters.
</p>



<hr/>

<p>
<a name="<b>lines-between-sections</b>" id="<b>lines-between-sections</b>"></a>
<a name="variable==*lines-between-sections*" id="variable==*lines-between-sections*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.3.17" class="outline-5">
<h5 id="sec-1.9.3.17"><span class="section-number-5">1.9.3.17</span> Internal Variable: <code>*lines-between-sections*</code></h5>
<div class="outline-text-5" id="text-1.9.3.17">




</div>

<div id="outline-container-1.9.3.17.1" class="outline-6">
<h6 id="sec-1.9.3.17.1"><span class="section-number-6">1.9.3.17.1</span> Value</h6>
<div class="outline-text-6" id="text-1.9.3.17.1">


<pre class="example">
T
</pre>


<p>
Type: <code>boolean</code>
</p>

</div>

</div>

<div id="outline-container-1.9.3.17.2" class="outline-6">
<h6 id="sec-1.9.3.17.2"><span class="section-number-6">1.9.3.17.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.3.17.2">


<p>
If true, sections of the document will be separated by horizontal lines.
</p>



<hr/>

<p>
<a name="<b>out</b>" id="<b>out</b>"></a>
<a name="variable==*out*" id="variable==*out*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.3.18" class="outline-5">
<h5 id="sec-1.9.3.18"><span class="section-number-5">1.9.3.18</span> Internal Variable: <code>*out*</code></h5>
<div class="outline-text-5" id="text-1.9.3.18">




</div>

<div id="outline-container-1.9.3.18.1" class="outline-6">
<h6 id="sec-1.9.3.18.1"><span class="section-number-6">1.9.3.18.1</span> Value</h6>
<div class="outline-text-6" id="text-1.9.3.18.1">


<pre class="example">
#&lt;SB-SYS:FD-STREAM for "file /home/paul/Dropbox/lisp/clod/doc/clod-doc.org"
{FCB6D11}&gt;
</pre>


<p>
Type: <code>fd-stream</code>
</p>

</div>

</div>

<div id="outline-container-1.9.3.18.2" class="outline-6">
<h6 id="sec-1.9.3.18.2"><span class="section-number-6">1.9.3.18.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.3.18.2">


<p>
Global variable that is bound to the output stream used by CLOD
while writing documentation.
</p>



<hr/>

<p>
<a name="<b>unsafe-html-chars</b>" id="<b>unsafe-html-chars</b>"></a>
<a name="variable==*unsafe-html-chars*" id="variable==*unsafe-html-chars*"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.3.19" class="outline-5">
<h5 id="sec-1.9.3.19"><span class="section-number-5">1.9.3.19</span> Internal Variable: <code>*unsafe-html-chars*</code></h5>
<div class="outline-text-5" id="text-1.9.3.19">




</div>

<div id="outline-container-1.9.3.19.1" class="outline-6">
<h6 id="sec-1.9.3.19.1"><span class="section-number-6">1.9.3.19.1</span> Value</h6>
<div class="outline-text-6" id="text-1.9.3.19.1">


<pre class="example">
(#\&lt; #\&gt; #\= #\% #\? #\+ #\$ #\/ #\&amp; #\@ #\, #\{ #\} #\^ #\~)
</pre>


<p>
Type: <code>cons</code>
</p>

</div>

</div>

<div id="outline-container-1.9.3.19.2" class="outline-6">
<h6 id="sec-1.9.3.19.2"><span class="section-number-6">1.9.3.19.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.3.19.2">


<p>
List of characters which are unsafe within HTML links and anchors, and
which need to be converted to a safe representation.
</p>
<p>
See also: <a href="#html-safe-string">html-safe-string</a>.
</p>




</div>
</div>
</div>

</div>

<div id="outline-container-1.9.4" class="outline-4">
<h4 id="sec-1.9.4"><span class="section-number-4">1.9.4</span> Internal Macros</h4>
<div class="outline-text-4" id="text-1.9.4">



<hr/>

<p>
<a name="do-own-symbols" id="do-own-symbols"></a>
<a name="macro==do-own-symbols" id="macro==do-own-symbols"></a>
</p>


</div>

<div id="outline-container-1.9.4.1" class="outline-5">
<h5 id="sec-1.9.4.1"><span class="section-number-5">1.9.4.1</span> Internal Macro: <code>do-own-symbols</code></h5>
<div class="outline-text-5" id="text-1.9.4.1">




</div>

<div id="outline-container-1.9.4.1.1" class="outline-6">
<h6 id="sec-1.9.4.1.1"><span class="section-number-6">1.9.4.1.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.4.1.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>do-own-symbols <span style="color: #696969;">(</span>var pkg<span style="color: #696969;">)</span>
  <span style="color: #d2691e; font-weight: bold;">&amp;body</span>
  body<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.4.1.2" class="outline-6">
<h6 id="sec-1.9.4.1.2"><span class="section-number-6">1.9.4.1.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.4.1.2">


<dl>
<dt>VAR</dt><dd>
symbol naming a variable that will be bound to each symbol in turn.
</dd>
<dt>PKG</dt><dd>
a package.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.4.1.3" class="outline-6">
<h6 id="sec-1.9.4.1.3"><span class="section-number-6">1.9.4.1.3</span> Description</h6>
<div class="outline-text-6" id="text-1.9.4.1.3">


<p>
Iterate through all the non-imported symbols in the package <code>PKG</code>.
<code>BODY</code> is executed once for each such symbol, with <code>VAR</code> bound to each
symbol in turn.
</p>


<hr/>

<p>
<a name="write-indented" id="write-indented"></a>
<a name="macro==write-indented" id="macro==write-indented"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.4.2" class="outline-5">
<h5 id="sec-1.9.4.2"><span class="section-number-5">1.9.4.2</span> Internal Macro: <code>write-indented</code></h5>
<div class="outline-text-5" id="text-1.9.4.2">




</div>

<div id="outline-container-1.9.4.2.1" class="outline-6">
<h6 id="sec-1.9.4.2.1"><span class="section-number-6">1.9.4.2.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.4.2.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-indented <span style="color: #696969;">(</span>indent<span style="color: #696969;">)</span>
  <span style="color: #d2691e; font-weight: bold;">&amp;body</span>
  body<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.4.2.2" class="outline-6">
<h6 id="sec-1.9.4.2.2"><span class="section-number-6">1.9.4.2.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.4.2.2">


<dl>
<dt>INDENT</dt><dd>
An integer.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.4.2.3" class="outline-6">
<h6 id="sec-1.9.4.2.3"><span class="section-number-6">1.9.4.2.3</span> Return Value</h6>
<div class="outline-text-6" id="text-1.9.4.2.3">


<p>
Ignored.
</p></div>

</div>

<div id="outline-container-1.9.4.2.4" class="outline-6">
<h6 id="sec-1.9.4.2.4"><span class="section-number-6">1.9.4.2.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.4.2.4">


<p>
All text that is written within the body of the form will be indented
a further <code>INDENT</code> spaces from the left margin.
</p>


<hr/>

<p>
<a name="writing-bulleted-list" id="writing-bulleted-list"></a>
<a name="macro==writing-bulleted-list" id="macro==writing-bulleted-list"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.4.3" class="outline-5">
<h5 id="sec-1.9.4.3"><span class="section-number-5">1.9.4.3</span> Internal Macro: <code>writing-bulleted-list</code></h5>
<div class="outline-text-5" id="text-1.9.4.3">




</div>

<div id="outline-container-1.9.4.3.1" class="outline-6">
<h6 id="sec-1.9.4.3.1"><span class="section-number-6">1.9.4.3.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.4.3.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>writing-bulleted-list
  <span style="color: #d2691e; font-weight: bold;">&amp;body</span>
  body<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.4.3.2" class="outline-6">
<h6 id="sec-1.9.4.3.2"><span class="section-number-6">1.9.4.3.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.4.3.2">


<p>
All output within the body of a form is assumed to be within a
bulleted list.
</p>



<hr/>

<p>
<a name="writing-section" id="writing-section"></a>
<a name="macro==writing-section" id="macro==writing-section"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.4.4" class="outline-5">
<h5 id="sec-1.9.4.4"><span class="section-number-5">1.9.4.4</span> Internal Macro: <code>writing-section</code></h5>
<div class="outline-text-5" id="text-1.9.4.4">




</div>

<div id="outline-container-1.9.4.4.1" class="outline-6">
<h6 id="sec-1.9.4.4.1"><span class="section-number-6">1.9.4.4.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.4.4.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>writing-section <span style="color: #696969;">(</span>title<span style="color: #696969;">)</span>
  <span style="color: #d2691e; font-weight: bold;">&amp;body</span>
  body<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.4.4.2" class="outline-6">
<h6 id="sec-1.9.4.4.2"><span class="section-number-6">1.9.4.4.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.4.4.2">


<p>
Wraps all output within the body of the form in its own section.
</p>



<hr/>

<p>
<a name="writing-section-for-symbol" id="writing-section-for-symbol"></a>
<a name="macro==writing-section-for-symbol" id="macro==writing-section-for-symbol"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.4.5" class="outline-5">
<h5 id="sec-1.9.4.5"><span class="section-number-5">1.9.4.5</span> Internal Macro: <code>writing-section-for-symbol</code></h5>
<div class="outline-text-5" id="text-1.9.4.5">




</div>

<div id="outline-container-1.9.4.5.1" class="outline-6">
<h6 id="sec-1.9.4.5.1"><span class="section-number-6">1.9.4.5.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.4.5.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>writing-section-for-symbol <span style="color: #696969;">(</span>entity sym<span style="color: #696969;">)</span>
  <span style="color: #d2691e; font-weight: bold;">&amp;body</span>
  body<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.4.5.2" class="outline-6">
<h6 id="sec-1.9.4.5.2"><span class="section-number-6">1.9.4.5.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.4.5.2">


<p>
Wraps all output within the body of the form in its own section. The
title of the section describes the entity of type <code>ENTITY</code> that is
bound to the symbol <code>SYM</code>.
</p>




</div>
</div>
</div>

</div>

<div id="outline-container-1.9.5" class="outline-4">
<h4 id="sec-1.9.5"><span class="section-number-4">1.9.5</span> Internal Functions</h4>
<div class="outline-text-4" id="text-1.9.5">



<hr/>

<p>
<a name="accessible-symbols" id="accessible-symbols"></a>
<a name="function==accessible-symbols" id="function==accessible-symbols"></a>
</p>


</div>

<div id="outline-container-1.9.5.1" class="outline-5">
<h5 id="sec-1.9.5.1"><span class="section-number-5">1.9.5.1</span> Internal Function: <code>accessible-symbols</code></h5>
<div class="outline-text-5" id="text-1.9.5.1">




</div>

<div id="outline-container-1.9.5.1.1" class="outline-6">
<h6 id="sec-1.9.5.1.1"><span class="section-number-6">1.9.5.1.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.1.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>accessible-symbols syms access pkg<span style="color: #696969;">)</span>
</pre>



</div>

</div>
