suturo_planning_3rd_party/clod/doc/clod-doc.org
***** Arguments

- SYMS :: A list of symbols.
- ACCESS :: One of the keywords =:INTERNAL= or =:EXTERNAL=.
- PKG :: A package object.
***** Returns

A list of symbols.
***** Description

Given a list of symbols, SYMS, returns the subset of SYMS whose
accessibility in PKG matches ACCESS.


-----

# link target 2: <<ampersand-symbol..3f..>>
# link target: <<function ampersand-symbol..3f..>>


**** Internal Function: =ampersand-symbol?=                                :function:


***** Syntax

#+BEGIN_SRC lisp
(ampersand-symbol? sym)
#+END_SRC


***** Description

Does the symbol SYM begin with an ampersand, such as &ANY, &REST and
so on?



-----

# link target 2: <<declared-special-p>>
# link target: <<function declared-special-p>>


**** Internal Function: =declared-special-p=                               :function:


***** Syntax

#+BEGIN_SRC lisp
(declared-special-p symbol)
#+END_SRC


***** Description

Returns true if SYMBOL is declared special.



-----

# link target 2: <<docpkg>>
# link target: <<function docpkg>>


**** Internal Function: =docpkg=                                           :function:


***** Syntax

#+BEGIN_SRC lisp
(docpkg &rest packages)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<document>>
# link target: <<function document>>


**** Internal Function: =document=                                         :function:


***** Syntax

#+BEGIN_SRC lisp
(document sym doctype)
#+END_SRC

***** Arguments

- SYM :: a symbol.
- DOCTYPE :: an [[..3d..entity..3d..][=entity=]].
***** Returns:

Ignored.
***** Description

Writes a section documenting the [[..3d..entity..3d..][=entity=]] named =SYM= which is of entity type
=DOCTYPE=.


-----

# link target 2: <<document-package-contents>>
# link target: <<function document-package-contents>>


**** Internal Function: =document-package-contents=                        :function:


***** Syntax

#+BEGIN_SRC lisp
(document-package-contents pkg &optional (accessibilities *accessibilities*))
#+END_SRC

***** Arguments

- PKG :: A package name or package object.
- ACCESSIBILITIES :: A list containing zero or more of the symbols
  =:external= or =:internal=.
***** Return Value

Ignored.
***** Description

Writes documentation for all symbols contained within the package =PKG=.
Does not write documentation for the actual package object.


-----

# link target 2: <<entity-..3e..string>>
# link target: <<function entity-..3e..string>>


**** Internal Function: =entity->string=                                   :function:


***** Syntax

#+BEGIN_SRC lisp
(entity->string entity)
#+END_SRC

***** Arguments

- ENTITY :: An [[..3d..entity..3d..][=entity=]].
***** Returns

A string.
***** Description

Given an entity, returns a string that can be used to describe that
entity type in human-readable form, in headings, etc.


-----

# link target 2: <<entity-..3e..tag>>
# link target: <<function entity-..3e..tag>>


**** Internal Function: =entity->tag=                                      :function:


***** Syntax

#+BEGIN_SRC lisp
(entity->tag entity)
#+END_SRC

***** Arguments

- ENTITY :: An [[..3d..entity..3d..][=entity=]].
***** Returns

A string.
***** Description

Given an entity, returns a string that can be used as a *tag* denoting that
entity type in org mode. See [[http://orgmode.org/manual/Tags.html]] for
information on tags.


-----

# link target 2: <<find-pkg>>
# link target: <<function find-pkg>>


**** Internal Function: =find-pkg=                                         :function:


***** Syntax

#+BEGIN_SRC lisp
(find-pkg pkg)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<find-sym>>
# link target: <<function find-sym>>


**** Internal Function: =find-sym=                                         :function:


