suturo_planning_3rd_party/clod/doc/clod-doc.html

<div id="outline-container-1.9.5.1.2" class="outline-6">
<h6 id="sec-1.9.5.1.2"><span class="section-number-6">1.9.5.1.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.1.2">


<dl>
<dt>SYMS</dt><dd>
A list of symbols.
</dd>
<dt>ACCESS</dt><dd>
One of the keywords <code>:INTERNAL</code> or <code>:EXTERNAL</code>.
</dd>
<dt>PKG</dt><dd>
A package object.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.1.3" class="outline-6">
<h6 id="sec-1.9.5.1.3"><span class="section-number-6">1.9.5.1.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.9.5.1.3">


<p>
A list of symbols.
</p></div>

</div>

<div id="outline-container-1.9.5.1.4" class="outline-6">
<h6 id="sec-1.9.5.1.4"><span class="section-number-6">1.9.5.1.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.1.4">


<p>
Given a list of symbols, SYMS, returns the subset of SYMS whose
accessibility in PKG matches ACCESS.
</p>


<hr/>

<p>
<a name="ampersand-symbol..3f.." id="ampersand-symbol..3f.."></a>
<a name="function==ampersand-symbol..3f.." id="function==ampersand-symbol..3f.."></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.2" class="outline-5">
<h5 id="sec-1.9.5.2"><span class="section-number-5">1.9.5.2</span> Internal Function: <code>ampersand-symbol?</code></h5>
<div class="outline-text-5" id="text-1.9.5.2">




</div>

<div id="outline-container-1.9.5.2.1" class="outline-6">
<h6 id="sec-1.9.5.2.1"><span class="section-number-6">1.9.5.2.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.2.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>ampersand-symbol? sym<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.2.2" class="outline-6">
<h6 id="sec-1.9.5.2.2"><span class="section-number-6">1.9.5.2.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.2.2">


<p>
Does the symbol SYM begin with an ampersand, such as &amp;ANY, &amp;REST and
so on?
</p>



<hr/>

<p>
<a name="declared-special-p" id="declared-special-p"></a>
<a name="function==declared-special-p" id="function==declared-special-p"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.3" class="outline-5">
<h5 id="sec-1.9.5.3"><span class="section-number-5">1.9.5.3</span> Internal Function: <code>declared-special-p</code></h5>
<div class="outline-text-5" id="text-1.9.5.3">




</div>

<div id="outline-container-1.9.5.3.1" class="outline-6">
<h6 id="sec-1.9.5.3.1"><span class="section-number-6">1.9.5.3.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.3.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>declared-special-p <span style="color: #1e90ff; font-weight: bold;">symbol</span><span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.3.2" class="outline-6">
<h6 id="sec-1.9.5.3.2"><span class="section-number-6">1.9.5.3.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.3.2">


<p>
Returns true if SYMBOL is declared special.
</p>



<hr/>

<p>
<a name="docpkg" id="docpkg"></a>
<a name="function==docpkg" id="function==docpkg"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.4" class="outline-5">
<h5 id="sec-1.9.5.4"><span class="section-number-5">1.9.5.4</span> Internal Function: <code>docpkg</code></h5>
<div class="outline-text-5" id="text-1.9.5.4">




</div>

<div id="outline-container-1.9.5.4.1" class="outline-6">
<h6 id="sec-1.9.5.4.1"><span class="section-number-6">1.9.5.4.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.4.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>docpkg <span style="color: #d2691e; font-weight: bold;">&amp;rest</span> packages<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.4.2" class="outline-6">
<h6 id="sec-1.9.5.4.2"><span class="section-number-6">1.9.5.4.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.4.2">


<p>
Not documented.
</p>



<hr/>

<p>
<a name="document" id="document"></a>
<a name="function==document" id="function==document"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.5" class="outline-5">
<h5 id="sec-1.9.5.5"><span class="section-number-5">1.9.5.5</span> Internal Function: <code>document</code></h5>
<div class="outline-text-5" id="text-1.9.5.5">




</div>

<div id="outline-container-1.9.5.5.1" class="outline-6">
<h6 id="sec-1.9.5.5.1"><span class="section-number-6">1.9.5.5.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.5.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>document sym doctype<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.5.2" class="outline-6">
<h6 id="sec-1.9.5.5.2"><span class="section-number-6">1.9.5.5.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.5.2">


<dl>
<dt>SYM</dt><dd>
a symbol.
</dd>
<dt>DOCTYPE</dt><dd>
an <a href="#..3d..entity..3d.."><code>entity</code></a>.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.5.3" class="outline-6">
<h6 id="sec-1.9.5.5.3"><span class="section-number-6">1.9.5.5.3</span> Returns:</h6>
<div class="outline-text-6" id="text-1.9.5.5.3">


<p>
Ignored.
</p></div>

</div>

<div id="outline-container-1.9.5.5.4" class="outline-6">
<h6 id="sec-1.9.5.5.4"><span class="section-number-6">1.9.5.5.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.5.4">


<p>
Writes a section documenting the <a href="#..3d..entity..3d.."><code>entity</code></a> named <code>SYM</code> which is of entity type
<code>DOCTYPE</code>.
</p>


<hr/>

<p>
<a name="document-package-contents" id="document-package-contents"></a>
<a name="function==document-package-contents" id="function==document-package-contents"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.6" class="outline-5">
<h5 id="sec-1.9.5.6"><span class="section-number-5">1.9.5.6</span> Internal Function: <code>document-package-contents</code></h5>
<div class="outline-text-5" id="text-1.9.5.6">




</div>

<div id="outline-container-1.9.5.6.1" class="outline-6">
<h6 id="sec-1.9.5.6.1"><span class="section-number-6">1.9.5.6.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.6.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>document-package-contents pkg <span style="color: #d2691e; font-weight: bold;">&amp;optional</span> <span style="color: #696969;">(</span>accessibilities <span style="color: #00c5cd;">*accessibilities*</span><span style="color: #696969;">))</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.6.2" class="outline-6">
<h6 id="sec-1.9.5.6.2"><span class="section-number-6">1.9.5.6.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.6.2">


<dl>
<dt>PKG</dt><dd>
A package name or package object.
</dd>
<dt>ACCESSIBILITIES</dt><dd>
A list containing zero or more of the symbols
<code>:external</code> or <code>:internal</code>.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.6.3" class="outline-6">
<h6 id="sec-1.9.5.6.3"><span class="section-number-6">1.9.5.6.3</span> Return Value</h6>
<div class="outline-text-6" id="text-1.9.5.6.3">


<p>
Ignored.
</p></div>

</div>

<div id="outline-container-1.9.5.6.4" class="outline-6">
<h6 id="sec-1.9.5.6.4"><span class="section-number-6">1.9.5.6.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.6.4">


<p>
Writes documentation for all symbols contained within the package <code>PKG</code>.
Does not write documentation for the actual package object.
</p>


<hr/>

<p>
<a name="entity-..3e..string" id="entity-..3e..string"></a>
<a name="function==entity-..3e..string" id="function==entity-..3e..string"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.7" class="outline-5">
<h5 id="sec-1.9.5.7"><span class="section-number-5">1.9.5.7</span> Internal Function: <code>entity-&gt;string</code></h5>
<div class="outline-text-5" id="text-1.9.5.7">




</div>

<div id="outline-container-1.9.5.7.1" class="outline-6">
<h6 id="sec-1.9.5.7.1"><span class="section-number-6">1.9.5.7.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.7.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>entity-&gt;string entity<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.7.2" class="outline-6">
<h6 id="sec-1.9.5.7.2"><span class="section-number-6">1.9.5.7.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.7.2">


<dl>
<dt>ENTITY</dt><dd>
An <a href="#..3d..entity..3d.."><code>entity</code></a>.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.7.3" class="outline-6">
<h6 id="sec-1.9.5.7.3"><span class="section-number-6">1.9.5.7.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.9.5.7.3">


<p>
A string.
</p></div>

</div>

<div id="outline-container-1.9.5.7.4" class="outline-6">
<h6 id="sec-1.9.5.7.4"><span class="section-number-6">1.9.5.7.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.7.4">


<p>
Given an entity, returns a string that can be used to describe that
entity type in human-readable form, in headings, etc.
</p>


<hr/>

<p>
<a name="entity-..3e..tag" id="entity-..3e..tag"></a>
<a name="function==entity-..3e..tag" id="function==entity-..3e..tag"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.8" class="outline-5">
<h5 id="sec-1.9.5.8"><span class="section-number-5">1.9.5.8</span> Internal Function: <code>entity-&gt;tag</code></h5>
<div class="outline-text-5" id="text-1.9.5.8">




</div>

<div id="outline-container-1.9.5.8.1" class="outline-6">
<h6 id="sec-1.9.5.8.1"><span class="section-number-6">1.9.5.8.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.8.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>entity-&gt;tag entity<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.8.2" class="outline-6">
<h6 id="sec-1.9.5.8.2"><span class="section-number-6">1.9.5.8.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.8.2">


<dl>
<dt>ENTITY</dt><dd>
An <a href="#..3d..entity..3d.."><code>entity</code></a>.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.8.3" class="outline-6">
<h6 id="sec-1.9.5.8.3"><span class="section-number-6">1.9.5.8.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.9.5.8.3">


<p>
A string.
</p></div>

</div>

<div id="outline-container-1.9.5.8.4" class="outline-6">
<h6 id="sec-1.9.5.8.4"><span class="section-number-6">1.9.5.8.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.8.4">


<p>
Given an entity, returns a string that can be used as a <b>tag</b> denoting that
entity type in org mode. See <a href="http://orgmode.org/manual/Tags.html">http://orgmode.org/manual/Tags.html</a> for
information on tags.
</p>


<hr/>

<p>
<a name="find-pkg" id="find-pkg"></a>
<a name="function==find-pkg" id="function==find-pkg"></a>
</p>

</div>
</div>

</div>
