suturo_planning_3rd_party/clod/doc/clod-doc.org
***** Syntax

#+BEGIN_SRC lisp
(find-sym sym &optional (pkg (package-name *package*)))
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<function-lambda-list>>
# link target: <<function function-lambda-list>>


**** Internal Function: =function-lambda-list=                             :function:


***** Syntax

#+BEGIN_SRC lisp
(function-lambda-list func)
#+END_SRC

***** Arguments

- FUNC :: A function object, macro object, generic function object,
  or a symbol bound to a function or macro.
***** Returns

Two values:
- The lambda list of the function name or function object, FUNC; or nil if
  the function takes no arguments or the lambda list cannot be retrieved.
- A boolean value -- T if a lambda list (even an empty one) was found,
  NIL otherwise.
***** Description

Returns the lambda list associated with the definition of the function or
macro =FUNC=. For example, the lambda list for the common lisp function
=FIND= is the list:
: (ITEM SEQUENCE &KEY :FROM-END :TEST :TEST-NOT :START :END :KEY)


-----

# link target 2: <<function-name>>
# link target: <<function function-name>>


**** Internal Function: =function-name=                                    :function:


***** Syntax

#+BEGIN_SRC lisp
(function-name fn)
#+END_SRC

***** Arguments

- FN :: A function, generic function or macro object.
***** Returns

The name of a function or macro, or nil.
***** Description

Returns the official 'name' bound to the function, macro,
or generic function object FN. Returns =NIL= if no name can
be found or if the function is anonymous (=lambda=).


-----

# link target 2: <<html-safe-string>>
# link target: <<function html-safe-string>>


**** Internal Function: =html-safe-string=                                 :function:


***** Syntax

#+BEGIN_SRC lisp
(html-safe-string str)
#+END_SRC

***** Arguments

- STR :: A string.
***** Returns

A string.
***** Description


Given a string which is intended as a link target, return a copy in which we
remove or alter any unsafe characters that will stop the link working properly
when the document is exported to HTML.
***** See Also

- [[*unsafe-html-chars*]]


-----

# link target 2: <<list-..3e..string-with-commas>>
# link target: <<function list-..3e..string-with-commas>>


**** Internal Function: =list->string-with-commas=                         :function:


***** Syntax

#+BEGIN_SRC lisp
(list->string-with-commas ls)
#+END_SRC

***** Arguments

- LS :: A list of values.
***** Returns

A string.
***** Description

Given a list of arbitrary values, returns a string consisting of the
printed representations of those values, separated by commas and spaces.
***** Example

#+BEGIN_SRC lisp
 (list->string-with-commas '(a b 123))

 => "A, B, 123"
#+END_SRC


-----

# link target 2: <<list-all-direct-slots>>
# link target: <<function list-all-direct-slots>>


**** Internal Function: =list-all-direct-slots=                            :function:


***** Syntax

#+BEGIN_SRC lisp
(list-all-direct-slots classes)
#+END_SRC

***** Arguments

- CLASSES :: A list of class objects.
***** Return Value

A list of SLOT-DEFINITION instances.
***** Description

Return a list of all the direct SLOT-DEFINITION instances defined
for all the classes in CLASSES.


-----

# link target 2: <<list-all-indirect-slots>>
# link target: <<function list-all-indirect-slots>>


**** Internal Function: =list-all-indirect-slots=                          :function:


***** Syntax

#+BEGIN_SRC lisp
(list-all-indirect-slots classes)
#+END_SRC

***** Arguments

- CLASSES :: A list of class objects.
***** Return Value

A list of SLOT-DEFINITION instances.
***** Description

Return a list of all the indirect SLOT-DEFINITION instances defined
for all the classes in CLASSES.


-----

# link target 2: <<list-all-slot-accessors>>
# link target: <<function list-all-slot-accessors>>


**** Internal Function: =list-all-slot-accessors=                          :function:


