suturo_planning_3rd_party/clod/doc/clod-doc.html

<div id="outline-container-1.9.5.9" class="outline-5">
<h5 id="sec-1.9.5.9"><span class="section-number-5">1.9.5.9</span> Internal Function: <code>find-pkg</code></h5>
<div class="outline-text-5" id="text-1.9.5.9">




</div>

<div id="outline-container-1.9.5.9.1" class="outline-6">
<h6 id="sec-1.9.5.9.1"><span class="section-number-6">1.9.5.9.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.9.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>find-pkg pkg<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.9.2" class="outline-6">
<h6 id="sec-1.9.5.9.2"><span class="section-number-6">1.9.5.9.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.9.2">


<p>
Not documented.
</p>



<hr/>

<p>
<a name="find-sym" id="find-sym"></a>
<a name="function==find-sym" id="function==find-sym"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.10" class="outline-5">
<h5 id="sec-1.9.5.10"><span class="section-number-5">1.9.5.10</span> Internal Function: <code>find-sym</code></h5>
<div class="outline-text-5" id="text-1.9.5.10">




</div>

<div id="outline-container-1.9.5.10.1" class="outline-6">
<h6 id="sec-1.9.5.10.1"><span class="section-number-6">1.9.5.10.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.10.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>find-sym sym <span style="color: #d2691e; font-weight: bold;">&amp;optional</span> <span style="color: #696969;">(</span>pkg <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">package-name</span> <span style="color: #00868b; font-weight: bold;">*package*</span><span style="color: #696969;">)))</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.10.2" class="outline-6">
<h6 id="sec-1.9.5.10.2"><span class="section-number-6">1.9.5.10.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.10.2">


<p>
Not documented.
</p>



<hr/>

<p>
<a name="function-lambda-list" id="function-lambda-list"></a>
<a name="function==function-lambda-list" id="function==function-lambda-list"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.11" class="outline-5">
<h5 id="sec-1.9.5.11"><span class="section-number-5">1.9.5.11</span> Internal Function: <code>function-lambda-list</code></h5>
<div class="outline-text-5" id="text-1.9.5.11">




</div>

<div id="outline-container-1.9.5.11.1" class="outline-6">
<h6 id="sec-1.9.5.11.1"><span class="section-number-6">1.9.5.11.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.11.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>function-lambda-list func<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.11.2" class="outline-6">
<h6 id="sec-1.9.5.11.2"><span class="section-number-6">1.9.5.11.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.11.2">


<dl>
<dt>FUNC</dt><dd>
A function object, macro object, generic function object,
or a symbol bound to a function or macro.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.11.3" class="outline-6">
<h6 id="sec-1.9.5.11.3"><span class="section-number-6">1.9.5.11.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.9.5.11.3">


<p>
Two values:
</p><ul>
<li>
The lambda list of the function name or function object, FUNC; or nil if
the function takes no arguments or the lambda list cannot be retrieved.
</li>
<li>
A boolean value &ndash; T if a lambda list (even an empty one) was found,
NIL otherwise.
</li>
</ul>
</div>

</div>

<div id="outline-container-1.9.5.11.4" class="outline-6">
<h6 id="sec-1.9.5.11.4"><span class="section-number-6">1.9.5.11.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.11.4">


<p>
Returns the lambda list associated with the definition of the function or
macro <code>FUNC</code>. For example, the lambda list for the common lisp function
<code>FIND</code> is the list:
</p><pre class="example">
(ITEM SEQUENCE &amp;KEY :FROM-END :TEST :TEST-NOT :START :END :KEY)
</pre>




<hr/>

<p>
<a name="function-name" id="function-name"></a>
<a name="function==function-name" id="function==function-name"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.12" class="outline-5">
<h5 id="sec-1.9.5.12"><span class="section-number-5">1.9.5.12</span> Internal Function: <code>function-name</code></h5>
<div class="outline-text-5" id="text-1.9.5.12">




</div>

<div id="outline-container-1.9.5.12.1" class="outline-6">
<h6 id="sec-1.9.5.12.1"><span class="section-number-6">1.9.5.12.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.12.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>function-name fn<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.12.2" class="outline-6">
<h6 id="sec-1.9.5.12.2"><span class="section-number-6">1.9.5.12.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.12.2">


<dl>
<dt>FN</dt><dd>
A function, generic function or macro object.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.12.3" class="outline-6">
<h6 id="sec-1.9.5.12.3"><span class="section-number-6">1.9.5.12.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.9.5.12.3">


<p>
The name of a function or macro, or nil.
</p></div>

</div>

<div id="outline-container-1.9.5.12.4" class="outline-6">
<h6 id="sec-1.9.5.12.4"><span class="section-number-6">1.9.5.12.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.12.4">


<p>
Returns the official 'name' bound to the function, macro,
or generic function object FN. Returns <code>NIL</code> if no name can
be found or if the function is anonymous (<code>lambda</code>).
</p>


<hr/>

<p>
<a name="html-safe-string" id="html-safe-string"></a>
<a name="function==html-safe-string" id="function==html-safe-string"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.13" class="outline-5">
<h5 id="sec-1.9.5.13"><span class="section-number-5">1.9.5.13</span> Internal Function: <code>html-safe-string</code></h5>
<div class="outline-text-5" id="text-1.9.5.13">




</div>

<div id="outline-container-1.9.5.13.1" class="outline-6">
<h6 id="sec-1.9.5.13.1"><span class="section-number-6">1.9.5.13.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.13.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>html-safe-string str<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.13.2" class="outline-6">
<h6 id="sec-1.9.5.13.2"><span class="section-number-6">1.9.5.13.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.13.2">


<dl>
<dt>STR</dt><dd>
A string.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.13.3" class="outline-6">
<h6 id="sec-1.9.5.13.3"><span class="section-number-6">1.9.5.13.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.9.5.13.3">


<p>
A string.
</p></div>

</div>

<div id="outline-container-1.9.5.13.4" class="outline-6">
<h6 id="sec-1.9.5.13.4"><span class="section-number-6">1.9.5.13.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.13.4">



<p>
Given a string which is intended as a link target, return a copy in which we
remove or alter any unsafe characters that will stop the link working properly
when the document is exported to HTML.
</p></div>

</div>

<div id="outline-container-1.9.5.13.5" class="outline-6">
<h6 id="sec-1.9.5.13.5"><span class="section-number-6">1.9.5.13.5</span> See Also</h6>
<div class="outline-text-6" id="text-1.9.5.13.5">


<ul>
<li>
<a href="#*unsafe-html-chars*"><b>unsafe-html-chars</b></a>


</li>
</ul>


<hr/>

<p>
<a name="list-..3e..string-with-commas" id="list-..3e..string-with-commas"></a>
<a name="function==list-..3e..string-with-commas" id="function==list-..3e..string-with-commas"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.14" class="outline-5">
<h5 id="sec-1.9.5.14"><span class="section-number-5">1.9.5.14</span> Internal Function: <code>list-&gt;string-with-commas</code></h5>
<div class="outline-text-5" id="text-1.9.5.14">




</div>

<div id="outline-container-1.9.5.14.1" class="outline-6">
<h6 id="sec-1.9.5.14.1"><span class="section-number-6">1.9.5.14.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.14.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>list-&gt;string-with-commas ls<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.14.2" class="outline-6">
<h6 id="sec-1.9.5.14.2"><span class="section-number-6">1.9.5.14.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.14.2">


<dl>
<dt>LS</dt><dd>
A list of values.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.14.3" class="outline-6">
<h6 id="sec-1.9.5.14.3"><span class="section-number-6">1.9.5.14.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.9.5.14.3">


<p>
A string.
</p></div>

</div>

<div id="outline-container-1.9.5.14.4" class="outline-6">
<h6 id="sec-1.9.5.14.4"><span class="section-number-6">1.9.5.14.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.14.4">


<p>
Given a list of arbitrary values, returns a string consisting of the
printed representations of those values, separated by commas and spaces.
</p></div>

</div>

<div id="outline-container-1.9.5.14.5" class="outline-6">
<h6 id="sec-1.9.5.14.5"><span class="section-number-6">1.9.5.14.5</span> Example</h6>
<div class="outline-text-6" id="text-1.9.5.14.5">





<pre class="src src-lisp"><span style="color: #696969;">(</span>list-&gt;string-with-commas '<span style="color: #696969;">(</span>a b <span style="color: #2e8b57;">123</span><span style="color: #696969;">))</span>

=&gt; <span style="color: #008b00;">"A, B, 123"</span>
</pre>





<hr/>

<p>
<a name="list-all-direct-slots" id="list-all-direct-slots"></a>
<a name="function==list-all-direct-slots" id="function==list-all-direct-slots"></a>
</p>

</div>
</div>

</div>
