suturo_planning_3rd_party/clod/doc/clod-doc.org
***** Description

Map over proper and not proper lists.



-----

# link target 2: <<org-safe-symbol>>
# link target: <<function org-safe-symbol>>


**** Internal Function: =org-safe-symbol=                                  :function:


***** Syntax

#+BEGIN_SRC lisp
(org-safe-symbol sym)
#+END_SRC

***** Arguments

- SYM :: A symbol.
***** Return Value

A string.
***** Description

Given the symbol SYM, return a string that represents SYM in a form that is
human-readable and where org will not be confused by any characters that
might represent markup instructions.


-----

# link target 2: <<replace-strings-with-symbols>>
# link target: <<function replace-strings-with-symbols>>


**** Internal Function: =replace-strings-with-symbols=                     :function:


***** Syntax

#+BEGIN_SRC lisp
(replace-strings-with-symbols tree)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<simple-type..3f..>>
# link target: <<function simple-type..3f..>>


**** Internal Function: =simple-type?=                                     :function:


***** Syntax

#+BEGIN_SRC lisp
(simple-type? sym)
#+END_SRC

***** Arguments

- SYM :: A symbol.
***** Return Value

Boolean.
***** Description

Returns =T= if =SYM= names a non-class type, such as can be
defined by [[deftype]].


-----

# link target 2: <<str..2b..>>
# link target: <<function str..2b..>>


**** Internal Function: =str+=                                             :function:


***** Syntax

#+BEGIN_SRC lisp
(str+ &rest strings)
#+END_SRC

***** Arguments

- STRINGS :: One or more strings.
***** Returns

A string.
***** Description

Returns the concatenation of all supplied strings. Shorthand
for =(concatenate 'string . STRINGS)=.


-----

# link target 2: <<string-starts-with..3f..>>
# link target: <<function string-starts-with..3f..>>


**** Internal Function: =string-starts-with?=                              :function:


***** Syntax

#+BEGIN_SRC lisp
(string-starts-with? str start)
#+END_SRC

***** Arguments

- STR :: A string.
- START :: A smaller string.
***** Returns

Boolean.
***** Description

Predicate. Does the string =STR= start with the string =START=?


-----

# link target 2: <<symbol-accessibility>>
# link target: <<function symbol-accessibility>>


**** Internal Function: =symbol-accessibility=                             :function:


***** Syntax

#+BEGIN_SRC lisp
(symbol-accessibility sym &optional (pkg *package*))
#+END_SRC

***** Arguments

- SYM :: A symbol.
- PKG :: A package.
***** Returns

One of =:inherited, :internal, :external= or =nil=.
***** Description

Returns a symbol describing how the symbol =SYM= is accessible within
the package =PKG=. If =SYM= is exported by =PKG= then the function
returns =:external=, and so on.


-----

# link target 2: <<type-..3e..string>>
# link target: <<function type-..3e..string>>


**** Internal Function: =type->string=                                     :function:


***** Syntax

#+BEGIN_SRC lisp
(type->string typ)
#+END_SRC


***** Description

Returns a simple string representation of the type specifier =TYP=.



-----

# link target 2: <<uses-for-symbol>>
# link target: <<function uses-for-symbol>>


**** Internal Function: =uses-for-symbol=                                  :function:


***** Syntax

#+BEGIN_SRC lisp
(uses-for-symbol sym)
#+END_SRC

***** Arguments

- SYM :: A symbol.
***** Return Value

A list of [[..3d..entity..3d..][=entity=]] values.
