suturo_planning_3rd_party/clod/doc/clod-doc.html

<div id="outline-container-1.9.5.23.2" class="outline-6">
<h6 id="sec-1.9.5.23.2"><span class="section-number-6">1.9.5.23.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.23.2">


<p>
Map over proper and not proper lists.
</p>



<hr/>

<p>
<a name="org-safe-symbol" id="org-safe-symbol"></a>
<a name="function==org-safe-symbol" id="function==org-safe-symbol"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.24" class="outline-5">
<h5 id="sec-1.9.5.24"><span class="section-number-5">1.9.5.24</span> Internal Function: <code>org-safe-symbol</code></h5>
<div class="outline-text-5" id="text-1.9.5.24">




</div>

<div id="outline-container-1.9.5.24.1" class="outline-6">
<h6 id="sec-1.9.5.24.1"><span class="section-number-6">1.9.5.24.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.24.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>org-safe-symbol sym<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.24.2" class="outline-6">
<h6 id="sec-1.9.5.24.2"><span class="section-number-6">1.9.5.24.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.24.2">


<dl>
<dt>SYM</dt><dd>
A symbol.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.24.3" class="outline-6">
<h6 id="sec-1.9.5.24.3"><span class="section-number-6">1.9.5.24.3</span> Return Value</h6>
<div class="outline-text-6" id="text-1.9.5.24.3">


<p>
A string.
</p></div>

</div>

<div id="outline-container-1.9.5.24.4" class="outline-6">
<h6 id="sec-1.9.5.24.4"><span class="section-number-6">1.9.5.24.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.24.4">


<p>
Given the symbol SYM, return a string that represents SYM in a form that is
human-readable and where org will not be confused by any characters that
might represent markup instructions.
</p>


<hr/>

<p>
<a name="replace-strings-with-symbols" id="replace-strings-with-symbols"></a>
<a name="function==replace-strings-with-symbols" id="function==replace-strings-with-symbols"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.25" class="outline-5">
<h5 id="sec-1.9.5.25"><span class="section-number-5">1.9.5.25</span> Internal Function: <code>replace-strings-with-symbols</code></h5>
<div class="outline-text-5" id="text-1.9.5.25">




</div>

<div id="outline-container-1.9.5.25.1" class="outline-6">
<h6 id="sec-1.9.5.25.1"><span class="section-number-6">1.9.5.25.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.25.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>replace-strings-with-symbols tree<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.25.2" class="outline-6">
<h6 id="sec-1.9.5.25.2"><span class="section-number-6">1.9.5.25.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.25.2">


<p>
Not documented.
</p>



<hr/>

<p>
<a name="simple-type..3f.." id="simple-type..3f.."></a>
<a name="function==simple-type..3f.." id="function==simple-type..3f.."></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.26" class="outline-5">
<h5 id="sec-1.9.5.26"><span class="section-number-5">1.9.5.26</span> Internal Function: <code>simple-type?</code></h5>
<div class="outline-text-5" id="text-1.9.5.26">




</div>

<div id="outline-container-1.9.5.26.1" class="outline-6">
<h6 id="sec-1.9.5.26.1"><span class="section-number-6">1.9.5.26.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.26.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>simple-type? sym<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.26.2" class="outline-6">
<h6 id="sec-1.9.5.26.2"><span class="section-number-6">1.9.5.26.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.26.2">


<dl>
<dt>SYM</dt><dd>
A symbol.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.26.3" class="outline-6">
<h6 id="sec-1.9.5.26.3"><span class="section-number-6">1.9.5.26.3</span> Return Value</h6>
<div class="outline-text-6" id="text-1.9.5.26.3">


<p>
Boolean.
</p></div>

</div>

<div id="outline-container-1.9.5.26.4" class="outline-6">
<h6 id="sec-1.9.5.26.4"><span class="section-number-6">1.9.5.26.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.26.4">


<p>
Returns <code>T</code> if <code>SYM</code> names a non-class type, such as can be
defined by <a href="#sec-1.9.5.26.4">deftype</a>.
</p>


<hr/>

<p>
<a name="str..2b.." id="str..2b.."></a>
<a name="function==str..2b.." id="function==str..2b.."></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.27" class="outline-5">
<h5 id="sec-1.9.5.27"><span class="section-number-5">1.9.5.27</span> Internal Function: <code>str+</code></h5>
<div class="outline-text-5" id="text-1.9.5.27">




</div>

<div id="outline-container-1.9.5.27.1" class="outline-6">
<h6 id="sec-1.9.5.27.1"><span class="section-number-6">1.9.5.27.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.27.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>str+ <span style="color: #d2691e; font-weight: bold;">&amp;rest</span> strings<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.27.2" class="outline-6">
<h6 id="sec-1.9.5.27.2"><span class="section-number-6">1.9.5.27.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.27.2">


<dl>
<dt>STRINGS</dt><dd>
One or more strings.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.27.3" class="outline-6">
<h6 id="sec-1.9.5.27.3"><span class="section-number-6">1.9.5.27.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.9.5.27.3">


<p>
A string.
</p></div>

</div>

<div id="outline-container-1.9.5.27.4" class="outline-6">
<h6 id="sec-1.9.5.27.4"><span class="section-number-6">1.9.5.27.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.27.4">


<p>
Returns the concatenation of all supplied strings. Shorthand
for <code>(concatenate 'string . STRINGS)</code>.
</p>


<hr/>

<p>
<a name="string-starts-with..3f.." id="string-starts-with..3f.."></a>
<a name="function==string-starts-with..3f.." id="function==string-starts-with..3f.."></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.28" class="outline-5">
<h5 id="sec-1.9.5.28"><span class="section-number-5">1.9.5.28</span> Internal Function: <code>string-starts-with?</code></h5>
<div class="outline-text-5" id="text-1.9.5.28">




</div>

<div id="outline-container-1.9.5.28.1" class="outline-6">
<h6 id="sec-1.9.5.28.1"><span class="section-number-6">1.9.5.28.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.28.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>string-starts-with? str start<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.28.2" class="outline-6">
<h6 id="sec-1.9.5.28.2"><span class="section-number-6">1.9.5.28.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.28.2">


<dl>
<dt>STR</dt><dd>
A string.
</dd>
<dt>START</dt><dd>
A smaller string.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.28.3" class="outline-6">
<h6 id="sec-1.9.5.28.3"><span class="section-number-6">1.9.5.28.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.9.5.28.3">


<p>
Boolean.
</p></div>

</div>

<div id="outline-container-1.9.5.28.4" class="outline-6">
<h6 id="sec-1.9.5.28.4"><span class="section-number-6">1.9.5.28.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.28.4">


<p>
Predicate. Does the string <code>STR</code> start with the string <code>START</code>?
</p>


<hr/>

<p>
<a name="symbol-accessibility" id="symbol-accessibility"></a>
<a name="function==symbol-accessibility" id="function==symbol-accessibility"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.29" class="outline-5">
<h5 id="sec-1.9.5.29"><span class="section-number-5">1.9.5.29</span> Internal Function: <code>symbol-accessibility</code></h5>
<div class="outline-text-5" id="text-1.9.5.29">




</div>

<div id="outline-container-1.9.5.29.1" class="outline-6">
<h6 id="sec-1.9.5.29.1"><span class="section-number-6">1.9.5.29.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.29.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>symbol-accessibility sym <span style="color: #d2691e; font-weight: bold;">&amp;optional</span> <span style="color: #696969;">(</span>pkg <span style="color: #00868b; font-weight: bold;">*package*</span><span style="color: #696969;">))</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.29.2" class="outline-6">
<h6 id="sec-1.9.5.29.2"><span class="section-number-6">1.9.5.29.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.29.2">


<dl>
<dt>SYM</dt><dd>
A symbol.
</dd>
<dt>PKG</dt><dd>
A package.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.29.3" class="outline-6">
<h6 id="sec-1.9.5.29.3"><span class="section-number-6">1.9.5.29.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.9.5.29.3">


<p>
One of <code>:inherited, :internal, :external</code> or <code>nil</code>.
</p></div>

</div>

<div id="outline-container-1.9.5.29.4" class="outline-6">
<h6 id="sec-1.9.5.29.4"><span class="section-number-6">1.9.5.29.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.29.4">


<p>
Returns a symbol describing how the symbol <code>SYM</code> is accessible within
the package <code>PKG</code>. If <code>SYM</code> is exported by <code>PKG</code> then the function
returns <code>:external</code>, and so on.
</p>


<hr/>

<p>
<a name="type-..3e..string" id="type-..3e..string"></a>
<a name="function==type-..3e..string" id="function==type-..3e..string"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.30" class="outline-5">
<h5 id="sec-1.9.5.30"><span class="section-number-5">1.9.5.30</span> Internal Function: <code>type-&gt;string</code></h5>
<div class="outline-text-5" id="text-1.9.5.30">




</div>

<div id="outline-container-1.9.5.30.1" class="outline-6">
<h6 id="sec-1.9.5.30.1"><span class="section-number-6">1.9.5.30.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.30.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>type-&gt;string typ<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.30.2" class="outline-6">
<h6 id="sec-1.9.5.30.2"><span class="section-number-6">1.9.5.30.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.30.2">


<p>
Returns a simple string representation of the type specifier <code>TYP</code>.
</p>



<hr/>

<p>
<a name="uses-for-symbol" id="uses-for-symbol"></a>
<a name="function==uses-for-symbol" id="function==uses-for-symbol"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.31" class="outline-5">
<h5 id="sec-1.9.5.31"><span class="section-number-5">1.9.5.31</span> Internal Function: <code>uses-for-symbol</code></h5>
<div class="outline-text-5" id="text-1.9.5.31">




</div>

<div id="outline-container-1.9.5.31.1" class="outline-6">
<h6 id="sec-1.9.5.31.1"><span class="section-number-6">1.9.5.31.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.31.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>uses-for-symbol sym<span style="color: #696969;">)</span>
</pre>



</div>

</div>
