suturo_planning_3rd_party/clod/doc/clod-doc.org
***** Description

Given a symbol =SYM=, return a list of entity values, describing the
different meanings/bindings of =SYM= within its home package.


-----

# link target 2: <<word-wrap>>
# link target: <<function word-wrap>>


**** Internal Function: =word-wrap=                                        :function:


***** Syntax

#+BEGIN_SRC lisp
(word-wrap text &key (width 80) respect-newlines respect-hyphens
           exclude-start-char exclude-end-char)
#+END_SRC

***** Arguments

- TEXT :: A string.
- WIDTH :: An integer. The maximum length of lines once TEXT is wrapped.
  Default is 80.
- RESPECT-NEWLINES :: Boolean. Should newline characters within the string
  be treated as unbreakable? (=NIL=)
- RESPECT-HYPHENS :: Boolean. Should we refrain from breaking hyphenated
  words? (=NIL=)
- EXCLUDE-START-CHAR :: A character, or nil.
- EXCLUDE-END-CHAR :: A character, or nil.

***** Return Value

A list of strings.

***** Description

Given a string =TEXT=, breaks the string into a series of
smaller strings, none of which is longer than =WIDTH=. Returns the list of
strings.

If =EXCLUDE-START-CHAR= and =EXCLUDE-END-CHAR= are supplied, those characters
will be treated as demarcating sections of the string whose length is to
be ignored (treated as zero).


-----

# link target 2: <<wrap-and-write>>
# link target: <<function wrap-and-write>>


**** Internal Function: =wrap-and-write=                                   :function:


***** Syntax

#+BEGIN_SRC lisp
(wrap-and-write fmt &rest args)
#+END_SRC


***** Description

Wraps the result of =(FORMAT NIL FMT . ARGS)=, then writes the
resulting paragraph to output.



-----

# link target 2: <<wrap-and-write-code>>
# link target: <<function wrap-and-write-code>>


**** Internal Function: =wrap-and-write-code=                              :function:


***** Syntax

#+BEGIN_SRC lisp
(wrap-and-write-code fmt &rest args)
#+END_SRC


***** Description

Wraps the result of =(FORMAT NIL FMT . ARGS)=, then writes the
resulting paragraph with 'literal' or 'source code block' markup.



-----

# link target 2: <<write-bullet-point>>
# link target: <<function write-bullet-point>>


**** Internal Function: =write-bullet-point=                               :function:


***** Syntax

#+BEGIN_SRC lisp
(write-bullet-point fmt &rest args)
#+END_SRC


***** Description

Writes a the result of =(FORMAT NIL FMT . ARGS)= as a point within
an active bulleted list.



-----

# link target 2: <<write-chapter>>
# link target: <<function write-chapter>>


**** Internal Function: =write-chapter=                                    :function:


***** Syntax

#+BEGIN_SRC lisp
(write-chapter symlist entity title)
#+END_SRC

***** Arguments

- SYMLIST :: A list of symbols.
- ENTITY :: An [[..3d..entity..3d..][=entity=]].
- TITLE :: A string.
***** Return Value

Ignored.
***** Description

Writes the section of the document which describes all entities of
type =ENTITY=. =SYMLIST= should be a list of all the symbols that
name such entities.


-----

# link target 2: <<write-class-hierarchy>>
# link target: <<function write-class-hierarchy>>


**** Internal Function: =write-class-hierarchy=                            :function:


***** Syntax

#+BEGIN_SRC lisp
(write-class-hierarchy classes)
#+END_SRC

***** Arguments

- CLASSES :: A list of CLASS objects.
***** Returns

Ignored.
***** Description

Writes the inheritance tree of CLASSES as a GraphViz diagram, using the
DOT language. External parent classes are also included.

See http://www.graphviz.org/ for details of the GraphViz language.


-----

# link target 2: <<write-colophon>>
# link target: <<function write-colophon>>


**** Internal Function: =write-colophon=                                   :function:


***** Syntax

#+BEGIN_SRC lisp
(write-colophon)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<write-disambiguation>>
# link target: <<function write-disambiguation>>


**** Internal Function: =write-disambiguation=                             :function:


