suturo_planning_3rd_party/clod/doc/clod-doc.html

<div id="outline-container-1.9.5.31.2" class="outline-6">
<h6 id="sec-1.9.5.31.2"><span class="section-number-6">1.9.5.31.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.31.2">


<dl>
<dt>SYM</dt><dd>
A symbol.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.31.3" class="outline-6">
<h6 id="sec-1.9.5.31.3"><span class="section-number-6">1.9.5.31.3</span> Return Value</h6>
<div class="outline-text-6" id="text-1.9.5.31.3">


<p>
A list of <a href="#..3d..entity..3d.."><code>entity</code></a> values.
</p></div>

</div>

<div id="outline-container-1.9.5.31.4" class="outline-6">
<h6 id="sec-1.9.5.31.4"><span class="section-number-6">1.9.5.31.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.31.4">


<p>
Given a symbol <code>SYM</code>, return a list of entity values, describing the
different meanings/bindings of <code>SYM</code> within its home package.
</p>


<hr/>

<p>
<a name="word-wrap" id="word-wrap"></a>
<a name="function==word-wrap" id="function==word-wrap"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.32" class="outline-5">
<h5 id="sec-1.9.5.32"><span class="section-number-5">1.9.5.32</span> Internal Function: <code>word-wrap</code></h5>
<div class="outline-text-5" id="text-1.9.5.32">




</div>

<div id="outline-container-1.9.5.32.1" class="outline-6">
<h6 id="sec-1.9.5.32.1"><span class="section-number-6">1.9.5.32.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.32.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>word-wrap text <span style="color: #d2691e; font-weight: bold;">&amp;key</span> <span style="color: #696969;">(</span>width <span style="color: #2e8b57;">80</span><span style="color: #696969;">)</span> respect-newlines respect-hyphens
           exclude-start-char exclude-end-char<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.32.2" class="outline-6">
<h6 id="sec-1.9.5.32.2"><span class="section-number-6">1.9.5.32.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.32.2">


<dl>
<dt>TEXT</dt><dd>
A string.
</dd>
<dt>WIDTH</dt><dd>
An integer. The maximum length of lines once TEXT is wrapped.
Default is 80.
</dd>
<dt>RESPECT-NEWLINES</dt><dd>
Boolean. Should newline characters within the string
be treated as unbreakable? (<code>NIL</code>)
</dd>
<dt>RESPECT-HYPHENS</dt><dd>
Boolean. Should we refrain from breaking hyphenated
words? (<code>NIL</code>)
</dd>
<dt>EXCLUDE-START-CHAR</dt><dd>
A character, or nil.
</dd>
<dt>EXCLUDE-END-CHAR</dt><dd>
A character, or nil.

</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.32.3" class="outline-6">
<h6 id="sec-1.9.5.32.3"><span class="section-number-6">1.9.5.32.3</span> Return Value</h6>
<div class="outline-text-6" id="text-1.9.5.32.3">


<p>
A list of strings.
</p>
</div>

</div>

<div id="outline-container-1.9.5.32.4" class="outline-6">
<h6 id="sec-1.9.5.32.4"><span class="section-number-6">1.9.5.32.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.32.4">


<p>
Given a string <code>TEXT</code>, breaks the string into a series of
smaller strings, none of which is longer than <code>WIDTH</code>. Returns the list of
strings.
</p>
<p>
If <code>EXCLUDE-START-CHAR</code> and <code>EXCLUDE-END-CHAR</code> are supplied, those characters
will be treated as demarcating sections of the string whose length is to
be ignored (treated as zero).
</p>


<hr/>

<p>
<a name="wrap-and-write" id="wrap-and-write"></a>
<a name="function==wrap-and-write" id="function==wrap-and-write"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.33" class="outline-5">
<h5 id="sec-1.9.5.33"><span class="section-number-5">1.9.5.33</span> Internal Function: <code>wrap-and-write</code></h5>
<div class="outline-text-5" id="text-1.9.5.33">




</div>

<div id="outline-container-1.9.5.33.1" class="outline-6">
<h6 id="sec-1.9.5.33.1"><span class="section-number-6">1.9.5.33.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.33.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>wrap-and-write fmt <span style="color: #d2691e; font-weight: bold;">&amp;rest</span> args<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.33.2" class="outline-6">
<h6 id="sec-1.9.5.33.2"><span class="section-number-6">1.9.5.33.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.33.2">


<p>
Wraps the result of <code>(FORMAT NIL FMT . ARGS)</code>, then writes the
resulting paragraph to output.
</p>



<hr/>

<p>
<a name="wrap-and-write-code" id="wrap-and-write-code"></a>
<a name="function==wrap-and-write-code" id="function==wrap-and-write-code"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.34" class="outline-5">
<h5 id="sec-1.9.5.34"><span class="section-number-5">1.9.5.34</span> Internal Function: <code>wrap-and-write-code</code></h5>
<div class="outline-text-5" id="text-1.9.5.34">




</div>

<div id="outline-container-1.9.5.34.1" class="outline-6">
<h6 id="sec-1.9.5.34.1"><span class="section-number-6">1.9.5.34.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.34.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>wrap-and-write-code fmt <span style="color: #d2691e; font-weight: bold;">&amp;rest</span> args<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.34.2" class="outline-6">
<h6 id="sec-1.9.5.34.2"><span class="section-number-6">1.9.5.34.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.34.2">


<p>
Wraps the result of <code>(FORMAT NIL FMT . ARGS)</code>, then writes the
resulting paragraph with 'literal' or 'source code block' markup.
</p>



<hr/>

<p>
<a name="write-bullet-point" id="write-bullet-point"></a>
<a name="function==write-bullet-point" id="function==write-bullet-point"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.35" class="outline-5">
<h5 id="sec-1.9.5.35"><span class="section-number-5">1.9.5.35</span> Internal Function: <code>write-bullet-point</code></h5>
<div class="outline-text-5" id="text-1.9.5.35">




</div>

<div id="outline-container-1.9.5.35.1" class="outline-6">
<h6 id="sec-1.9.5.35.1"><span class="section-number-6">1.9.5.35.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.35.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-bullet-point fmt <span style="color: #d2691e; font-weight: bold;">&amp;rest</span> args<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.35.2" class="outline-6">
<h6 id="sec-1.9.5.35.2"><span class="section-number-6">1.9.5.35.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.35.2">


<p>
Writes a the result of <code>(FORMAT NIL FMT . ARGS)</code> as a point within
an active bulleted list.
</p>



<hr/>

<p>
<a name="write-chapter" id="write-chapter"></a>
<a name="function==write-chapter" id="function==write-chapter"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.36" class="outline-5">
<h5 id="sec-1.9.5.36"><span class="section-number-5">1.9.5.36</span> Internal Function: <code>write-chapter</code></h5>
<div class="outline-text-5" id="text-1.9.5.36">




</div>

<div id="outline-container-1.9.5.36.1" class="outline-6">
<h6 id="sec-1.9.5.36.1"><span class="section-number-6">1.9.5.36.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.36.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-chapter symlist entity title<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.36.2" class="outline-6">
<h6 id="sec-1.9.5.36.2"><span class="section-number-6">1.9.5.36.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.36.2">


<dl>
<dt>SYMLIST</dt><dd>
A list of symbols.
</dd>
<dt>ENTITY</dt><dd>
An <a href="#..3d..entity..3d.."><code>entity</code></a>.
</dd>
<dt>TITLE</dt><dd>
A string.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.36.3" class="outline-6">
<h6 id="sec-1.9.5.36.3"><span class="section-number-6">1.9.5.36.3</span> Return Value</h6>
<div class="outline-text-6" id="text-1.9.5.36.3">


<p>
Ignored.
</p></div>

</div>

<div id="outline-container-1.9.5.36.4" class="outline-6">
<h6 id="sec-1.9.5.36.4"><span class="section-number-6">1.9.5.36.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.36.4">


<p>
Writes the section of the document which describes all entities of
type <code>ENTITY</code>. <code>SYMLIST</code> should be a list of all the symbols that
name such entities.
</p>


<hr/>

<p>
<a name="write-class-hierarchy" id="write-class-hierarchy"></a>
<a name="function==write-class-hierarchy" id="function==write-class-hierarchy"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.37" class="outline-5">
<h5 id="sec-1.9.5.37"><span class="section-number-5">1.9.5.37</span> Internal Function: <code>write-class-hierarchy</code></h5>
<div class="outline-text-5" id="text-1.9.5.37">




</div>

<div id="outline-container-1.9.5.37.1" class="outline-6">
<h6 id="sec-1.9.5.37.1"><span class="section-number-6">1.9.5.37.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.37.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-class-hierarchy classes<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.37.2" class="outline-6">
<h6 id="sec-1.9.5.37.2"><span class="section-number-6">1.9.5.37.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.37.2">


<dl>
<dt>CLASSES</dt><dd>
A list of CLASS objects.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.37.3" class="outline-6">
<h6 id="sec-1.9.5.37.3"><span class="section-number-6">1.9.5.37.3</span> Returns</h6>
<div class="outline-text-6" id="text-1.9.5.37.3">


<p>
Ignored.
</p></div>

</div>

<div id="outline-container-1.9.5.37.4" class="outline-6">
<h6 id="sec-1.9.5.37.4"><span class="section-number-6">1.9.5.37.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.37.4">


<p>
Writes the inheritance tree of CLASSES as a GraphViz diagram, using the
DOT language. External parent classes are also included.
</p>
<p>
See <a href="http://www.graphviz.org/">http://www.graphviz.org/</a> for details of the GraphViz language.
</p>


<hr/>

<p>
<a name="write-colophon" id="write-colophon"></a>
<a name="function==write-colophon" id="function==write-colophon"></a>
</p>

</div>
</div>

</div>
