suturo_planning_3rd_party/clod/doc/clod-doc.org
***** Syntax

#+BEGIN_SRC lisp
(write-disambiguation sym uses)
#+END_SRC


***** Description

Writes a section providing disambiguating links for the symbol
SYM, which is bound in multiple namespaces.



-----

# link target 2: <<write-docstring>>
# link target: <<function write-docstring>>


**** Internal Function: =write-docstring=                                  :function:


***** Syntax

#+BEGIN_SRC lisp
(write-docstring str &key (levels *heading-level*) (default not documented.))
#+END_SRC

***** Arguments

- STR :: A docstring.
- LEVELS :: How many levels deep in the outline is
  this docstring?
- DEFAULT :: A string. Default text, used if =STR= is =NIL=.
***** Return Value

Ignored.
***** Description

Writes the docstring STR to the document. Before doing this, processes
the docstring to:
- Demote headings
- Make all hyperlinks safe for org mode and HTML export
- Convert lines beginning with ';;;' to syntax-highlighting markup.


-----

# link target 2: <<write-docstring-section>>
# link target: <<function write-docstring-section>>


**** Internal Function: =write-docstring-section=                          :function:


***** Syntax

#+BEGIN_SRC lisp
(write-docstring-section title docstr)
#+END_SRC


***** Description

Writes the documentation string DOCSTR within its own subsection.



-----

# link target 2: <<write-heading>>
# link target: <<function write-heading>>


**** Internal Function: =write-heading=                                    :function:


***** Syntax

#+BEGIN_SRC lisp
(write-heading title)
#+END_SRC


***** Description

Writes a section heading entitled =TITLE=.



-----

# link target 2: <<write-index>>
# link target: <<function write-index>>


**** Internal Function: =write-index=                                      :function:


***** Syntax

#+BEGIN_SRC lisp
(write-index pkg &optional (accessibilities (list internal external)))
#+END_SRC


***** Description

Writes a section containing an alphabetical index of all the symbols
in the package PKG.



-----

# link target 2: <<write-lambda-list-section>>
# link target: <<function write-lambda-list-section>>


**** Internal Function: =write-lambda-list-section=                        :function:


***** Syntax

#+BEGIN_SRC lisp
(write-lambda-list-section sym)
#+END_SRC


***** Description

Writes a section describing the lambda list of the function or macro SYM.



-----

# link target 2: <<write-lines>>
# link target: <<function write-lines>>


**** Internal Function: =write-lines=                                      :function:


***** Syntax

#+BEGIN_SRC lisp
(write-lines &rest lines)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<write-list-as-paragraph>>
# link target: <<function write-list-as-paragraph>>


**** Internal Function: =write-list-as-paragraph=                          :function:


***** Syntax

#+BEGIN_SRC lisp
(write-list-as-paragraph ls)
#+END_SRC


***** Description

LS is a list of items. Writes all the items in LS to output as a
single wrapped paragraph. Individual items are separated by commas.



-----

# link target 2: <<write-out>>
# link target: <<function write-out>>


**** Internal Function: =write-out=                                        :function:


***** Syntax

#+BEGIN_SRC lisp
(write-out fmt &rest args)
#+END_SRC


***** Description

Writes the result of =(FORMAT NIL FMT . ARGS)= to output.



-----

# link target 2: <<write-preamble>>
# link target: <<function write-preamble>>


**** Internal Function: =write-preamble=                                   :function:


***** Syntax

#+BEGIN_SRC lisp
(write-preamble)
#+END_SRC

***** Arguments

None.
***** Return Value

Ignored.
