suturo_planning_3rd_party/clod/doc/clod-doc.html

<div id="outline-container-1.9.5.38" class="outline-5">
<h5 id="sec-1.9.5.38"><span class="section-number-5">1.9.5.38</span> Internal Function: <code>write-colophon</code></h5>
<div class="outline-text-5" id="text-1.9.5.38">




</div>

<div id="outline-container-1.9.5.38.1" class="outline-6">
<h6 id="sec-1.9.5.38.1"><span class="section-number-6">1.9.5.38.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.38.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-colophon<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.38.2" class="outline-6">
<h6 id="sec-1.9.5.38.2"><span class="section-number-6">1.9.5.38.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.38.2">


<p>
Not documented.
</p>



<hr/>

<p>
<a name="write-disambiguation" id="write-disambiguation"></a>
<a name="function==write-disambiguation" id="function==write-disambiguation"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.39" class="outline-5">
<h5 id="sec-1.9.5.39"><span class="section-number-5">1.9.5.39</span> Internal Function: <code>write-disambiguation</code></h5>
<div class="outline-text-5" id="text-1.9.5.39">




</div>

<div id="outline-container-1.9.5.39.1" class="outline-6">
<h6 id="sec-1.9.5.39.1"><span class="section-number-6">1.9.5.39.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.39.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-disambiguation sym uses<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.39.2" class="outline-6">
<h6 id="sec-1.9.5.39.2"><span class="section-number-6">1.9.5.39.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.39.2">


<p>
Writes a section providing disambiguating links for the symbol
SYM, which is bound in multiple namespaces.
</p>



<hr/>

<p>
<a name="write-docstring" id="write-docstring"></a>
<a name="function==write-docstring" id="function==write-docstring"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.40" class="outline-5">
<h5 id="sec-1.9.5.40"><span class="section-number-5">1.9.5.40</span> Internal Function: <code>write-docstring</code></h5>
<div class="outline-text-5" id="text-1.9.5.40">




</div>

<div id="outline-container-1.9.5.40.1" class="outline-6">
<h6 id="sec-1.9.5.40.1"><span class="section-number-6">1.9.5.40.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.40.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-docstring str <span style="color: #d2691e; font-weight: bold;">&amp;key</span> <span style="color: #696969;">(</span>levels <span style="color: #00c5cd;">*heading-level*</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>default <span style="color: #1e90ff; font-weight: bold;">not</span> documented.<span style="color: #696969;">))</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.40.2" class="outline-6">
<h6 id="sec-1.9.5.40.2"><span class="section-number-6">1.9.5.40.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.40.2">


<dl>
<dt>STR</dt><dd>
A docstring.
</dd>
<dt>LEVELS</dt><dd>
How many levels deep in the outline is
this docstring?
</dd>
<dt>DEFAULT</dt><dd>
A string. Default text, used if <code>STR</code> is <code>NIL</code>.
</dd>
</dl>
</div>

</div>

<div id="outline-container-1.9.5.40.3" class="outline-6">
<h6 id="sec-1.9.5.40.3"><span class="section-number-6">1.9.5.40.3</span> Return Value</h6>
<div class="outline-text-6" id="text-1.9.5.40.3">


<p>
Ignored.
</p></div>

</div>

<div id="outline-container-1.9.5.40.4" class="outline-6">
<h6 id="sec-1.9.5.40.4"><span class="section-number-6">1.9.5.40.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.40.4">


<p>
Writes the docstring STR to the document. Before doing this, processes
the docstring to:
</p><ul>
<li>
Demote headings
</li>
<li>
Make all hyperlinks safe for org mode and HTML export
</li>
<li>
Convert lines beginning with ';;;' to syntax-highlighting markup.


</li>
</ul>


<hr/>

<p>
<a name="write-docstring-section" id="write-docstring-section"></a>
<a name="function==write-docstring-section" id="function==write-docstring-section"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.41" class="outline-5">
<h5 id="sec-1.9.5.41"><span class="section-number-5">1.9.5.41</span> Internal Function: <code>write-docstring-section</code></h5>
<div class="outline-text-5" id="text-1.9.5.41">




</div>

<div id="outline-container-1.9.5.41.1" class="outline-6">
<h6 id="sec-1.9.5.41.1"><span class="section-number-6">1.9.5.41.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.41.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-docstring-section title docstr<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.41.2" class="outline-6">
<h6 id="sec-1.9.5.41.2"><span class="section-number-6">1.9.5.41.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.41.2">


<p>
Writes the documentation string DOCSTR within its own subsection.
</p>



<hr/>

<p>
<a name="write-heading" id="write-heading"></a>
<a name="function==write-heading" id="function==write-heading"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.42" class="outline-5">
<h5 id="sec-1.9.5.42"><span class="section-number-5">1.9.5.42</span> Internal Function: <code>write-heading</code></h5>
<div class="outline-text-5" id="text-1.9.5.42">




</div>

<div id="outline-container-1.9.5.42.1" class="outline-6">
<h6 id="sec-1.9.5.42.1"><span class="section-number-6">1.9.5.42.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.42.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-heading title<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.42.2" class="outline-6">
<h6 id="sec-1.9.5.42.2"><span class="section-number-6">1.9.5.42.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.42.2">


<p>
Writes a section heading entitled <code>TITLE</code>.
</p>



<hr/>

<p>
<a name="write-index" id="write-index"></a>
<a name="function==write-index" id="function==write-index"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.43" class="outline-5">
<h5 id="sec-1.9.5.43"><span class="section-number-5">1.9.5.43</span> Internal Function: <code>write-index</code></h5>
<div class="outline-text-5" id="text-1.9.5.43">




</div>

<div id="outline-container-1.9.5.43.1" class="outline-6">
<h6 id="sec-1.9.5.43.1"><span class="section-number-6">1.9.5.43.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.43.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-index pkg <span style="color: #d2691e; font-weight: bold;">&amp;optional</span> <span style="color: #696969;">(</span>accessibilities <span style="color: #696969;">(</span><span style="color: #1e90ff; font-weight: bold;">list</span> internal external<span style="color: #696969;">)))</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.43.2" class="outline-6">
<h6 id="sec-1.9.5.43.2"><span class="section-number-6">1.9.5.43.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.43.2">


<p>
Writes a section containing an alphabetical index of all the symbols
in the package PKG.
</p>



<hr/>

<p>
<a name="write-lambda-list-section" id="write-lambda-list-section"></a>
<a name="function==write-lambda-list-section" id="function==write-lambda-list-section"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.44" class="outline-5">
<h5 id="sec-1.9.5.44"><span class="section-number-5">1.9.5.44</span> Internal Function: <code>write-lambda-list-section</code></h5>
<div class="outline-text-5" id="text-1.9.5.44">




</div>

<div id="outline-container-1.9.5.44.1" class="outline-6">
<h6 id="sec-1.9.5.44.1"><span class="section-number-6">1.9.5.44.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.44.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-lambda-list-section sym<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.44.2" class="outline-6">
<h6 id="sec-1.9.5.44.2"><span class="section-number-6">1.9.5.44.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.44.2">


<p>
Writes a section describing the lambda list of the function or macro SYM.
</p>



<hr/>

<p>
<a name="write-lines" id="write-lines"></a>
<a name="function==write-lines" id="function==write-lines"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.45" class="outline-5">
<h5 id="sec-1.9.5.45"><span class="section-number-5">1.9.5.45</span> Internal Function: <code>write-lines</code></h5>
<div class="outline-text-5" id="text-1.9.5.45">




</div>

<div id="outline-container-1.9.5.45.1" class="outline-6">
<h6 id="sec-1.9.5.45.1"><span class="section-number-6">1.9.5.45.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.45.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-lines <span style="color: #d2691e; font-weight: bold;">&amp;rest</span> lines<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.45.2" class="outline-6">
<h6 id="sec-1.9.5.45.2"><span class="section-number-6">1.9.5.45.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.45.2">


<p>
Not documented.
</p>



<hr/>

<p>
<a name="write-list-as-paragraph" id="write-list-as-paragraph"></a>
<a name="function==write-list-as-paragraph" id="function==write-list-as-paragraph"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.46" class="outline-5">
<h5 id="sec-1.9.5.46"><span class="section-number-5">1.9.5.46</span> Internal Function: <code>write-list-as-paragraph</code></h5>
<div class="outline-text-5" id="text-1.9.5.46">




</div>

<div id="outline-container-1.9.5.46.1" class="outline-6">
<h6 id="sec-1.9.5.46.1"><span class="section-number-6">1.9.5.46.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.46.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-list-as-paragraph ls<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.46.2" class="outline-6">
<h6 id="sec-1.9.5.46.2"><span class="section-number-6">1.9.5.46.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.46.2">


<p>
LS is a list of items. Writes all the items in LS to output as a
single wrapped paragraph. Individual items are separated by commas.
</p>



<hr/>

<p>
<a name="write-out" id="write-out"></a>
<a name="function==write-out" id="function==write-out"></a>
</p>

</div>
</div>

</div>

<div id="outline-container-1.9.5.47" class="outline-5">
<h5 id="sec-1.9.5.47"><span class="section-number-5">1.9.5.47</span> Internal Function: <code>write-out</code></h5>
<div class="outline-text-5" id="text-1.9.5.47">




</div>

<div id="outline-container-1.9.5.47.1" class="outline-6">
<h6 id="sec-1.9.5.47.1"><span class="section-number-6">1.9.5.47.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.47.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-out fmt <span style="color: #d2691e; font-weight: bold;">&amp;rest</span> args<span style="color: #696969;">)</span>
</pre>




</div>

</div>

<div id="outline-container-1.9.5.47.2" class="outline-6">
<h6 id="sec-1.9.5.47.2"><span class="section-number-6">1.9.5.47.2</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.47.2">


<p>
Writes the result of <code>(FORMAT NIL FMT . ARGS)</code> to output.
</p>



<hr/>

<p>
<a name="write-preamble" id="write-preamble"></a>
<a name="function==write-preamble" id="function==write-preamble"></a>
</p>

</div>
</div>

</div>
