suturo_planning_3rd_party/clod/doc/clod-doc.org
***** Description

Writes some org instructions, intended to be placed at the start of the
document. These specify the document's author, title, and set some
export options.





** Index

 [[index A][A]]  [[index B][B]]  [[index C][C]]  [[index D][D]]  [[index E][E]]
 [[index F][F]]  [[index H][H]]  [[index L][L]]  [[index M][M]]  [[index O][O]]
 [[index R][R]]  [[index S][S]]  [[index T][T]]  [[index U][U]]  [[index W][W]]
 [[index NONALPHABETIC][NONALPHABETIC]]  


*** Nonalphabetic


# link target: <<index NONALPHABETIC>>
- [[variable *accessibilities*][=*accessibilities*=]], Variable
- [[variable *alphabet*][=*alphabet*=]], Variable
- [[variable *ambiguities*][=*ambiguities*=]], Variable
- [[variable *auto-links*][=*auto-links*=]], Variable
- [[variable *brief-methods*][=*brief-methods*=]], Variable
- [[variable *class-diagram*][=*class-diagram*=]], Variable
- [[variable *clod-version-string*][=*clod-version-string*=]], Variable
- [[variable *document-author*][=*document-author*=]], Variable
- [[variable *document-email*][=*document-email*=]], Variable
- [[variable *document-style-sheet*][=*document-style-sheet*=]], Variable
- [[variable *document-title*][=*document-title*=]], Variable
- [[variable *heading-char*][=*heading-char*=]], Variable
- [[variable *heading-level*][=*heading-level*=]], Variable
- [[variable *hyperspec-root*][=*hyperspec-root*=]], Variable
- [[variable *left-margin*][=*left-margin*=]], Variable
- [[variable *line-width*][=*line-width*=]], Variable
- [[variable *lines-between-sections*][=*lines-between-sections*=]], Variable
- [[variable *out*][=*out*=]], Variable
- [[variable *unsafe-html-chars*][=*unsafe-html-chars*=]], Variable
- [[type ..3d..entity..3d..][==entity==]], Type



*** A


# link target: <<index A>>
- [[function accessible-symbols][=accessible-symbols=]], Function
- [[function ampersand-symbol..3f..][=ampersand-symbol?=]], Function
- [[class animal][=animal=]], Class



*** B


# link target: <<index B>>
- [[class bird][=bird=]], Class



*** C


# link target: <<index C>>
- [[class cat][=cat=]], Class
- [[package clod][=clod=]], Package



*** D


# link target: <<index D>>
- [[function declared-special-p][=declared-special-p=]], Function
- [[macro do-own-symbols][=do-own-symbols=]], Macro
- [[function docpkg][=docpkg=]], Function
- [[function document][=document=]], Function
- [[function document-package][=document-package=]], Function
- [[function document-package-contents][=document-package-contents=]], Function
- [[function document-packages][=document-packages=]], Function
- [[class dog][=dog=]], Class



*** E


# link target: <<index E>>
- [[function entity-..3e..string][=entity->string=]], Function
- [[function entity-..3e..tag][=entity->tag=]], Function



*** F


# link target: <<index F>>
- [[function find-pkg][=find-pkg=]], Function
- [[function find-sym][=find-sym=]], Function
- [[function function-lambda-list][=function-lambda-list=]], Function
- [[function function-name][=function-name=]], Function



*** H


# link target: <<index H>>
- [[class hawk][=hawk=]], Class
- [[function html-safe-string][=html-safe-string=]], Function



*** L


# link target: <<index L>>
- [[function list-..3e..string-with-commas][=list->string-with-commas=]],
  Function
- [[function list-all-direct-slots][=list-all-direct-slots=]], Function
- [[function list-all-indirect-slots][=list-all-indirect-slots=]], Function
- [[function list-all-slot-accessors][=list-all-slot-accessors=]], Function



*** M


# link target: <<index M>>
- [[function make-class-link][=make-class-link=]], Function
- [[function make-link][=make-link=]], Function
- [[function make-package-link][=make-package-link=]], Function
- [[function make-specialised-lambda-list][=make-specialised-lambda-list=]],
  Function
- [[function make-target][=make-target=]], Function
- [[class mammal][=mammal=]], Class
- [[function map-list][=map-list=]], Function



*** O


# link target: <<index O>>
- [[function org-safe-symbol][=org-safe-symbol=]], Function



*** R


# link target: <<index R>>
- [[function replace-strings-with-symbols][=replace-strings-with-symbols=]],
  Function



*** S


# link target: <<index S>>
- [[function simple-type..3f..][=simple-type?=]], Function
- [[function str..2b..][=str+=]], Function
- [[function string-starts-with..3f..][=string-starts-with?=]], Function
- [[function symbol-accessibility][=symbol-accessibility=]], Function



*** T


# link target: <<index T>>
- [[function type-..3e..string][=type->string=]], Function



*** U


# link target: <<index U>>
- [[function uses-for-symbol][=uses-for-symbol=]], Function



*** W


# link target: <<index W>>
- [[function word-wrap][=word-wrap=]], Function
- [[function wrap-and-write][=wrap-and-write=]], Function
- [[function wrap-and-write-code][=wrap-and-write-code=]], Function
- [[function write-bullet-point][=write-bullet-point=]], Function
- [[function write-chapter][=write-chapter=]], Function
- [[function write-class-hierarchy][=write-class-hierarchy=]], Function
- [[function write-colophon][=write-colophon=]], Function
- [[function write-disambiguation][=write-disambiguation=]], Function
- [[function write-docstring][=write-docstring=]], Function
- [[function write-docstring-section][=write-docstring-section=]], Function
- [[function write-heading][=write-heading=]], Function
- [[macro write-indented][=write-indented=]], Macro
- [[function write-index][=write-index=]], Function
- [[function write-lambda-list-section][=write-lambda-list-section=]], Function
- [[function write-lines][=write-lines=]], Function
- [[function write-list-as-paragraph][=write-list-as-paragraph=]], Function
- [[function write-out][=write-out=]], Function
- [[function write-preamble][=write-preamble=]], Function
- [[macro writing-bulleted-list][=writing-bulleted-list=]], Macro
- [[macro writing-section][=writing-section=]], Macro
- [[macro writing-section-for-symbol][=writing-section-for-symbol=]], Macro





