suturo_planning_3rd_party/clod/doc/clod-doc.html

<div id="outline-container-1.9.5.48" class="outline-5">
<h5 id="sec-1.9.5.48"><span class="section-number-5">1.9.5.48</span> Internal Function: <code>write-preamble</code></h5>
<div class="outline-text-5" id="text-1.9.5.48">




</div>

<div id="outline-container-1.9.5.48.1" class="outline-6">
<h6 id="sec-1.9.5.48.1"><span class="section-number-6">1.9.5.48.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1.9.5.48.1">





<pre class="src src-lisp"><span style="color: #696969;">(</span>write-preamble<span style="color: #696969;">)</span>
</pre>



</div>

</div>

<div id="outline-container-1.9.5.48.2" class="outline-6">
<h6 id="sec-1.9.5.48.2"><span class="section-number-6">1.9.5.48.2</span> Arguments</h6>
<div class="outline-text-6" id="text-1.9.5.48.2">


<p>
None.
</p></div>

</div>

<div id="outline-container-1.9.5.48.3" class="outline-6">
<h6 id="sec-1.9.5.48.3"><span class="section-number-6">1.9.5.48.3</span> Return Value</h6>
<div class="outline-text-6" id="text-1.9.5.48.3">


<p>
Ignored.
</p></div>

</div>

<div id="outline-container-1.9.5.48.4" class="outline-6">
<h6 id="sec-1.9.5.48.4"><span class="section-number-6">1.9.5.48.4</span> Description</h6>
<div class="outline-text-6" id="text-1.9.5.48.4">


<p>
Writes some org instructions, intended to be placed at the start of the
document. These specify the document's author, title, and set some
export options.
</p>




</div>
</div>
</div>
</div>

</div>
